import 'package:flutter/cupertino.dart';
import 'package:flutter/material.dart';
import 'package:auto_size_text/auto_size_text.dart';

void main() => runApp(MainApp());
Map<String, int> data = {
  "ก": 1,
  "ด": 1,
  "ถ": 1,
  "ท": 1,
  "ภ": 1,
  "า": 1,
  "ำ": 1,
  "ฤ": 1,
  "่": 1,
  "ุ": 1,
  "ข": 2,
  "ช": 2,
  "ง": 2,
  "บ": 2,
  "ป": 2,
  "เ": 2,
  "แ": 2,
  "้": 2,
  "ู": 2,
  "ฃ": 3,
  "ฆ": 3,
  "ต": 3,
  "ฑ": 3,
  "ฒ": 3,
  "๋": 3,
  "ค": 4,
  "ธ": 4,
  "ญ": 4,
  "ร": 4,
  "ษ": 4,
  "ะ": 4,
  "โ": 4,
  "ั": 4,
  "ิ": 4,
  "ฉ": 5,
  "ฌ": 5,
  "ณ": 5,
  "น": 5,
  "ม": 5,
  "ห": 5,
  "ฎ": 5,
  "ฮ": 5,
  "ฬ": 5,
  "ึ": 5,
  "จ": 6,
  "ล": 6,
  "ว": 6,
  "อ": 6,
  "ใ": 6,
  "ซ": 7,
  "ศ": 7,
  "ส": 7,
  "ี": 7,
  "ื": 7,
  "๊": 7,
  "ผ": 8,
  "ฝ": 8,
  "พ": 8,
  "ฟ": 8,
  "ย": 8,
  "็": 8,
  "ฏ": 9,
  "ฐ": 9,
  "ไ": 9,
  "์": 9,
};
Map<int, String> result = {
  0: "เลข 0 คือ ดาวมฤตยู หมายถึง ความตาย ความดับสูญ หรือเคยผ่านความตายหรือเกือบตายมาแล้ว ความอาเภททั้งหลาย ความเก่าแก่ ความช้านาน สิ่งที่ล่วงมาแล้วในอดีต ศาสตร์ลึกลับ สิ่งที่เกิดขึ้นเหนือธรรมชาติ ความเร้นลับที่พิสูจน์ไม่ได้ด้วยวิชาวิทยาศาสตร์ ความพิศวง ประหลาด มห้ศจรรย์ ความชำรุด เสียหาย ผิดปกติ แปลกๆ แผลงๆ ภยันอันตรายร้ายแรง นักวิทยาศาสตร์ นักประดิษฐ์ นักค้นคว้าในศาสตร์ ด้านดี หมายถึง เป็นคนมีสติปัญญาเฉียบแหลม ค่อนไปทางสติเฟื่อง มีอำนาจลึกลับและอิทธิพล เอาชนะอุปสรรคได้อย่างประหลาด มีเสน่ห์ดึงดูด มีหัวคิดริเริ่ม หยั่งรู้เข้าในในศาสตร์ลี้ลับ มีบุคลิกภาพที่เป็นพิเศษเฉพาะตัว มักเกี่ยวเนื่องกับวิชาวิทยาศาสตร์และเทคโนโลยี เป็นนักค้นคว้า เป็นนักประดิษฐ์กรรมที่ทันสมัย ด้านเสีย หมายถึง มักมีเหตุการณ์ไม่ดีที่ไม่พึงประสงค์เกิดขึ้น หรือมีการเปลี่ยนแปลงไปในทางที่ไม่เป็นคุณ  เกิดทุกข์ภัยอาเภท หลงใหลในสิ่งผิดๆ นอกลู่นอกทาง ดันทุรัง แหกคอก กระด้าง ดื้อรั้น ชอบผ่าฝืนเจ้าอารมณ์มาก โกรธง่าย อารมณ์ตึงเครียด เอาแต่ใจ และเนื่องจากที่มีนิสัยอารมณ์แบบนี้ จึงทำให้มีอันตรายถึงชีวิตได้ จึงต้องควบคุมจิตใจและอารมณ์ให้ดี",
  1: "เลขของดาวอาทิตย์ (1) ผู้ที่มีค่าเลขศาสตร์ของชื่อและนามสกุลเกี่ยวข้องกับเลข 1 เป็นเลขแห่งความเชื่อมั่นในตัวเองสูง กล้าหาญ มีความทะเยอทะยานที่จะเป็นใหญ่เป็นโต สามารถไต่เต้าจากระดับฐานะหนึ่งสูงขึ้นไปจนถึงจุดสูงสุดที่ตนเองหวังได้ มีคนเชื่อถือและไว้วางใจ แต่จะพบกับการเปลี่ยนแปลงอยู่เสมอ โดยเฉพาะอย่างยิ่ง ถ้าทำงานในตำแหน่งใหญ่โต ก็จะต้องเข้าไปมีส่วนร่วมในการตัดสินใจเรื่องสำคัญๆที่พลาดไม่ได้อยู่เสมอ อาจมีปัญหากับลูกน้องบริวารทำให้เสื่อมเสียชื่อเสียง เหมาะสำหรับตั้งชื่อคนที่อ่อนแอ ขาดความรับผิดชอบ ไม่ค่อยกล้าหาญ หรือคนที่ทำอะไรแล้วไม่ประสบความสำเร็จ ถ้าเสริมด้วยเลขที่เป็นมงคลกับตัวเองแล้วจะยิ่งดีขึ้นได้ แต่จะมีตัวแปรของดวงชะตาต่างกัน อยู่ที่อิทธิพลของตัวเลขที่นำมาบวกรวมกัน ด้านดี หมายถึง มีน้ำใสใจจริง มีความจริงจังและจริงใจ มุ่งมั่น มีใจเป็นนักกีฬา เอื้อเฟื้อเผื่อแผ่ รักความยุติธรรม หยิ่งทรนงในเกียรติยศและศักดิ์ศรี ถือตัว เจ้ายศเจ้าศักดิ์ ชอบปรุงแต่งภาพลักษณ์ของตนเองให้ดูดีอยู่เสมอ มีความสดชื่นเบิกบาน ทะเยอทะยานและมีความกระตือรือร้นอยู่เป็นนิจสิน เป็นตัวแทนของความเป็นผู้นำ เป็นนักปกครอง มีความเชื่อมั่นในตัวเองสูง มีความรับผิดชอบ กล้าหาญ เป็นสัญลักษณ์แทนเพศชาย ด้านเสีย หมายถึง ไม่มีสปิริต ชอบวางอำนาจบาตรใหญ่ ปล่อยตัวตามสบาย ไม่สนใจในเรื่องเกียรติยศและชื่อเสียง เอาแต่ใจตัวเองเป็นใหญ่ ไม่สนใจในความรู้สึกของผู้อื่น รักง่ายหน่ายเร็ว ทำตัวเหมือนคนเบื่อโลก ใจร้อน ใจเร็ว เอาแต่ใจ มุทะลุ ถือทิษฐิ ใจใหญ๋ จมไม่ลง",
  2: "เลขของดาวจันทร์ (2) ผู้ที่มีค่าเลขศาสตร์ของชื่อและนามสกุลเกี่ยวข้องกับเลข 2 มักเป็นคนมีจินตนาการสูง จิตใจอ่อนไหว ละเมียดละไม บางครั้งคิดมาก เพ้อฟัน ประเภทสร้างวิมานในอากาศ ชอบกวีนิพนธ์ ชอบของละเอียดอ่อน สุนทรีย์ คล้อยตามคนอื่นได้ง่าย ชอบชีวิตอิสระ ชอบช่วยเหลือผู้อื่น ชอบทำให้คนอื่นมีความสุข เหมาะกับคนที่ชอบอยู่เบื้องหลังความสำเร็จของคนอื่น ไม่ชอบออกนอกหน้าเปิดเผยตัว ส่วนใหญ่จะทำงานที่เกี่ยวข้องกับของสวยๆงามๆ กลุ่มเป้าหมายที่เป็นผู้หญิง งานด้านสังคมสงเคราะห์ งานด้านบริการ งานด้านสาธารณสุข มักมีความผิดหวังเศร้าหมองมาก่อนความสุขเสมอ เหมาะสำหรับตั้งชื่อคนที่มุทะลุดุดัน ขี้โมโห หรือคนขาดความยั้งคิดทำอะไรไม่ประสบความสำเร็จ เพราะคิดเร็วทำเร็วมากเกินไป ถ้าเสริมด้วยเลขที่เป็นมงคลจะดียิ่งขึ้น แต่จะมีตัวแปรของดวงชะตาต่างกัน อยู่ที่อิทธิพลของตัวเลขที่นำมาบวกรวมกัน เลข 2 ดูเผินๆ เป็นคนอ่อนไหวแต่ถึงคราวคับขัน จะควบคุมสติได้ดี มีความกล้าเข็มแข็งอย่างน่าทึ่งเข้าทำนองอ่อนที่สุดก็แข็งที่สุด ส่วนความดื้อรั้น ดุจเดียวกับเลข 1 ดาวอาทิตย์ ด้านดี หมายถึง มีธรรมชาติทางอารมณ์มั่นคงดี จิตใจและความรู้สึกเป็นปกติคงเส้นคงวา สุภาพอ่อนโยน มีความเห็นอกเห็นใจ เมตตากรุณา ชอบช่วยเหลือผู้อื่นด้านเสีย หมายถึง มีธรรมชาติทางอารมณ์ไม่ดี จิตใจและอารมณ์อ่อนไหวง่ายและแปรปรวนเร็ว ไม่ชอบยุ่งเกี่ยวในกิจการของผู้อื่น ไม่ชอบเอาอกเอาใจใคร",
  3: "เลขของดาวอังคาร (3) ดาวแห่งความกล้าหาญชาญชัย ชอบการต่อสู้ ชอบสงคราม การสู้รบ ดาวอังคารจึงถือเป็นทั้งสงครามที่แท้จริง และสงครามทางกามารมณ์ อีกประการหนึ่ง เป็นเกษตรราศีพิจิก อันเป็นเครื่องหมายอวัยวะเพศด้วย ดาวอังคารยังหมายถึงโทสะจริต เอะอะปึงปัง ความขยันขันแข็ง ว่องไวบางครั้งดื้อรั้นแบบคนเลข 1 รวมไปถึงความหรูหรา ฟุ่มเฟือย ด้านดี หมายถึง มีจิตใจกล้าหาญเด็ดเดี่ยว มีสุขภาพร่างกายสมบูรณ์แข็งแรง ขยันขันแข็ง มีความกระตือรือร้น เอาการเอางาน เลือดลมดี ชอบการผจญภัย มีใจเป็นนักกีฬา ด้านเสีย หมายถึง มีจิตใจอ่อนแอและขี้ขลาด สุขภาพร่างกายไม่สมบูรณ์แข็งแรง การไหลเวียนของโลหิตบกพร่อง ใจร้อน มีแนวโน้มไปในทางกร้าวร้าว มุทะลุดุดัน หุนหันพลันแล่น ชอบหาเรื่องใส่ตัว",
  4: "ดาวพุธ (4) หมายถึง สติปัญญา แต่ปัญญาแบบพุธ เป็น ‘โลกีย์ปัญญา’ ปัญญาเลี้ยงปากเลี้ยงท้อง ปัญญาในทางโลก มีปฎิภาณเฉลียวฉลาด ว่องไว ทันคน ชอบติดต่อคบหาสมาคม เข้าไหนเข้าได้ เรียกว่า มีมนุษย์สัมพันธ์เป็นเลิศ เนื่องจากดาวพุธมักจะกลมกลืนกับสถานการณ์ได้ง่ายบางครั้งบ่งบอกถึงความไม่ แน่นอน ด้านดี หมายถึง มีธรรมชาติทางความคิดดี เฉลียวฉลาด คล่องแคล่วว่องไว มีเชาว์ปัญญา ปฎิภาณไหวพริบดี ช่างพูดช่างคุย เป็นคนมีเหตุผล มีความคล่องตัวและเก่งหลายด้าน การศึกษาต้องดูที่ดาวพุธเป็นหลักด้วย ด้านเสีย หมายถึง มีธรรมชาติทางความคิดไม่ดี ใช้ความเฉลียวฉลาดของตนเองไปในทางที่ไม่ถูกต้อง เจ้าเล่ห์ มารยาสาไถย พูดจาไม่เป็นเรื่องเป็นราวหาสาระประโยชน์ไม่ได้ ชอบตำหนิติเตียน สอดรู้สอดเห็น ชอบโวยวายจนติดเป็นนิสัย อารมณ์หงุดหงิดเป็นประจำ ประสาทอ่อน พิจารณาความคดโกงให้ดูดาวพุธเสื่อมเป็นหลัก",
  5: "เลขของดาวพฤหัส (5) เป็นปัญญาเช่นเดียวกับเลข 4 แต่เป็นปัญญาเหนือโลก เป็นความรู้ความเข้าใจโลกและชีวิต เลข 5 เป็นตัวแทนคุณธรรม จริยธรรม ความคงแก่เรียน ความยุติธรรม หมายถึงผู้ใหญ่ ครูอาจารย์ พระสงฆ์ ความสุขุมเยือกเย็นคน เลข 5 มักจะชอบศาสนา สิ่งศักดิ์สิทธิ์ เป็นคนมองโลกในแง่ดี บางครั้งก็ซื่อบริสุทธิ์เกินไปจนกลายเป็นคนเซ่อก็มี บางครั้งชอบสันโดษ จนกลายเป็นคนเห็นแก่ตัว ด้านดี หมายถึง มีธรรมชาติเป็นคนรักสงบ มีเมตตากรุณา เอื้อเฟื้อเผื่อแผ่ ร่าเริงเบิกบานอยู่ในแนวทางที่ถูกที่ควร มีความเชื่อมั่นในตัวเอง รู้จักพัฒนาตัวเอง ซื่อสัตย์สุจริต รักความยุติธรรม ชีวิตมักประสบแต่ความโชคร้าย ด้านเสีย หมายถึง มักขาดความยั้งคิด ควบคุมตัวเองไม่ได้ ใช้จ่ายเงินสรุ่ยสุร่าย โลภมาก งมงายในสิ่งไร้สาระ มีสติปัญญาก็ไม่สามารถใช้ให้เป็นประโยชน์ต่อตนเองได้",
  6: "ดาวศุกร์ (6) เป็นดาวศิลปะ สุนทรียะ ความรัก คนเลข 6 จึงมีเสน่ห์ รักสวยรักงาม มีรสนิยมดีชอบศิลปะ และดนตรี สนุกบันเทิง เป็นพวก ‘สุขนิยม’ ต้องการให้ผู้อื่นมีความสุขโดยไม่อิจฉาริษยา นอกจากนี้ยังรวมไปถึงโภคทรัพย์ ทรัพย์สินต่างๆ ในดวงชะตาชายหมายรวมถึง ความรัก ภรรยา ความปรารถนา อันสวยงาม ด้านดี หมายถึง มี ธรรมชาติในการปรุงแต่ง ดัดแปลง มีหัวในทางศิลปะ สุภาพอ่อนโยน จงรักภักดี รักสันติ รู้จักกาละเทศะ รู้ผ่อนหนักผ่อนเบา มีเสน่ห์ดึงดูดใจผู้ใกล้ชิด เจ้าชู้ ลุ่มหลงในกิเลสตัณหาและโลกีย์วิสัย นิยมชมชอบในสิ่งสวยงาม รักธรรมชาติ ด้านเสีย หมายถึง มีธรรมชาติเป็นคนเจ้าเล่ห์ ไม่มีความมั่นใจในตัวเอง โลภโมโทสัน ชอบหลงระเริงในแสงสีศิวิไลย์ มีตัณหาราคะมาก ไม่ค่อยสงวนตัว ไม่รักเกียรติ",
  7: "ดาวเสาร์ (7) เป็นสัญลักษณ์แห่งทุกข์โศก โรคภัย การสูญเสีย เลข 7 มักกำพร้า เร่ร่อน อยู่ไม่เป็นที่ มักเดือดร้อนเป็นนิตย์ ส่วนดีก็คือ มีสติปัญญาและความอดทนเป็นเลิศ แต่ตามตำราฝรั่งบอกว่า เลข 7 เป็นเลขเป็นเลขแห่งความสมบูรณ์ดีทุกด้าน เพราะพระเจ้าสร้างโลกสร้างโลกเสร็จภายใน 7 วัน สัปดาห์หนึ่งมี 7 วันจีนก็ถือว่า เลข 7 เป็นเลขดีในการตั้งชื่อ โดยใช้อักษรไทยให้หลีกเลี่ยงเลข 7 ไว้ได้เลยเพราะถือว่าเป็นดาวบาปเคราะห์ จะมีผลทางลบมากกว่าทางบวกแน่นอน ด้านดี หมายถึง เป็นคนเอาการเอางาน หนักแน่น อดทน เก็บกด ไม่ชอบเข้าสังคม สมถะ เก็บอารมณ์ได้ดี ซ่อนความรู้สึกเก่ง อ่านไม่ออกว่าดีหรือร้าย สุขุมเยือกเย็น เป็นผู้ใหญ่ แต่ถ้าโกรธแล้วจะรุนแรง ห้ามไม่อยู่เลยทีเดียว มีความละเอียดถี่ถ้วน ระมัดระวัง รักสงบ ด้านเสีย หมายถึง ธรรมชาติ ซึ่งเป็นคนเก็บกดอยู่แล้ว  ทำให้เป็นคนคิดมาก มีวิตกกังวล ฟุ้งซ่าน เงียบขรึมจนน่ากลัว เฉื่อยชา เย็นชาไม่มีชีวิตชีวา เจ้าทุกข์ อมทุกข์ ลืมเหตุการณ์สะเทือนใจไม่ได้ ไม่ไว้วางใจผู้อื่น ตระหนี่ จู้จี้ ขี้บ่น ไม่ชอบเข้าสังคม",
  8: "ราหู (8) เป็นเครื่องหมายแห่งอาถรรพณ์วิบัติลุ่มหลงมัวเมา มักถูกใส่ร้ายป้ายสีถูกกลั่นแกล้ง ราหูกับเสาร์ต่างเป็นเลขทุกข์เหมือนกัน แต่ทุกข์แบบเสาร์ เป็นความเศร้าโศก แห้งแล้ง ตรมไหม้ภายใน ทุกข์แบบราหูเป็นทุกข์เพราะถูกใส่ไคล้ทำให้มัวหมอง ล้มละลาย ผู้ใดมีชื่อที่มีเลข 8 ล่ะก็ เตรียมมั่วๆ เบรอๆ ได้เลย หลีกเลี่ยงไว้จึงจะดี  ด้านดี หมายถึง มีธรรมชาติเป็นคนมีความสามารถรอบด้าน มีความสามารถเฉพาะทางหรือความสามารถพิเศษ เช่น ในด้านกีฬา การพนัน การแข่งขันชิงดีชิงเด่น มีจิตรานุภาพสูง เข้มแข็ง มีความฉลียวฉลาด สามารถชักจูงและโน้มน้าวให้ผู้อื่นเชื่อถือได้ มีความศรัทธาในตัวของตัวเอง มีประสบการณ์ในด้านอบายมุข แก้ไขเหตุการณ์เฉพาะหน้าได้เก่ง มีความคล่องตัวสูง ด้านเสีย หมายถึง มีธรรมชาติในทางลุ่มหลงมัวเมา มักตกอยู่ในโมหะจริต เช่น คิดอยากรวย อยากสวย อยากได้ อยากมีและและอยากเป็น ตลอดจนลุ่มหลงมัวเมาอยุ่ใน รูปรส กลิ่น เสียง การสัมผัส มีความวู่วาม บุ่มบ่าม ขาดความยั้งคิด มีพรสวรรค์ในการฉ้อโกง เอารัดเอาเปรียบผู้อื่น เจ้าเล่ห์ ฉลาดแกมโกง กระล่อน ปลิ้นปล้อน ชอบหลบๆซ่อนๆ อำพรางตัวเอง",
  9: "เลขของดาวเกตุ (9) ดาวคราสของดวงอาทิตย์ เป็นเลขแห่งความลึกลับ สิ่งศักดิ์สิทธิ์ที่พิสูจน์ไม่ได้ มักมีความคิดฉับพลัน มีญาณสังหรณ์ที่แม่นยำ เลื่อมใสศรัทธา สนใจในศาสตร์เร้นลับ มีสัมผัสที่หก สนใจของเก่าแก่ ชอบสะสมของเก่า อีกอย่างหนึ่งเชื่อกันว่าดาวเกตุ (9) เป็นดาวคุ้มภัยให้แคล้วคลาด คุกตะรางและอุบัติเหตุได้ และยังช่วยให้อายุมั่นขวัญยืน ให้ชีวิตความเป็นอยู่ที่ดี มีความคิดเห็นตรงไปตรงมา บางครั้งก็มุทะลุถึงกร้าวร้าว มักชอบทำอะไรใหม่ๆ แปลกๆ เป็นผู้ริ่เริ่มและบุกเบิกสิ่งใหม่ๆอยู่เสมอๆ มักมีความขัดแย้งในตนเอง ตนมักตนเป็นศัตรูของตน โกรธง่ายหายเร็ว ด้านดี หมายถึง มีสิ่งศักดิ์สิทธ์คุ้มครอง เป็นตัวแทนของความ เชื่อมั่นในตัวเอง มีความคิดริ่เริ่มสิ่งใหม่ๆ เห็นอกเห็นใจคนอื่น สนใจในสิ่งหนึ่งสิ่งใดอย่างจริงจัง มักทำสิ่งต่างๆ ที่แปลกแหวกแนวไม่เหมือนใคร ด้านเสีย หมายถึง มีวิญญาณร้ายคอยรบกวนรังควาน มีความขัดแย้งในตนเอง หุนหันพลันแล่น รักใคร่หลงใหลอะไรได้ง่ายๆ มีบางส่งบางอย่างเก็บซ่อนไว้ภายในจิตใจ",
  10: "ความเปลี่ยนแปลงอย่างฉับพลัน : เป็นคู่ของดาวอาทิตย์ (1) และดาว มฤตยู (0) เป็นตัวเลขที่ค่อนข้างร้อนแรงและลึกลับ ชอบเดินทางไปยังต่างถิ่นต่างแดน มีความอยากเด่น อยากดัง เชื่อมั่นในตนเองสูง ชอบอิสระ ไม่ชอบอยู่ใต้บังคับบัญชาใคร เมื่อรวมกันแล้ว ทำให้เป็นคนแข็งแกร้าว ไม่ง้อคน ชอบแหวกแนว ไม่ค่อยนุ่มนวล  ด้านดี ก็คือ กล้าตัดสินใจ ทำกิจการใหญ่ได้ ไม่หวั่นไหวต่ออุปสรรคที่ขวางหน้า กล้าได้กล้าเสีย รักความยุติธรรม ไม่เอาเปรียบใคร ในชีวิตมักจะมีอุปสรรค คิดทำอะไรมักจะเจอคู่แข่ง มีคนปองร้าย บริวารมักจะให้โทษ เพราะตัวเองมักชอบเผด็จการ ทำให้ชีวิตมักอาภัพ มีศัตรูรอบด้าน บริวารและบุคคลในครอบครัวมักจะแข็งข้อ และก่อเหตุกระทบกระเทือนใจอย่างรุนแรงเสมอ ด้านเสีย คือในชีวิตมักจะมีอุปสรรค คิดทำอะไรมักจะเจอคู่แข่ง มีคนปองร้าย บริวารมักจะให้โทษ เพราะตัวเองมักชอบเผด็จการ ทำให้ชีวิตมักอาภัพ มีศัตรูรอบด้าน บริวารและบุคคลในครอบครัวมักจะแข็งข้อ และก่อเหตุกระทบกระเทือนใจอย่างรุนแรงเสมอ",
  11: "ว่าวที่ขาดลม : เป็นคู่ของดาวอาทิตย์ 2 ดวง มักเป็นคนที่มีบุคลิก 2 อย่างขัดแย้งกัน การแสดงภายนอกนุ่มนวล แต่ภายในแข็งแกร่ง มักจะซ่อนบุคลิกลักษณะอันแท้จริงไว้ภายใน ซึ่งทำให้คนอื่นอ่านยาก มักจะอำพรางส่วนลึกของจิตใจไม่ให้ใครเห็นใครรู้ จนยากที่ใครจะทายใจได้ง่ายๆ บุคคลที่เลขรวมกันได้ 11 มักจะเป็นคนหลงตัวเอง ทำอะไรชอบเอาแต่ใจตนเองเป็นใหญ่ เอาพวกพ้องเป็นหลัก เป็นคนที่จัดว่าเป็นคนดื้อรั้นอย่างหนัก ถ้าลองปักใจอะไรแล้วยากที่ใครจะมาเปลี่ยนแปลงได้ แต่บางครั้งจิตใจก็อ่อนไหวง่าย รวนเรไม่แน่นอน จึงมักจะถูกพวกลากมากไป ชีวิตต้องต่อสู้ดิ้นรน ฟันฝ่าอุปสรรคด้วยลำแข้งของตนเองตลอด เป็นเลขที่ทำให้มีความทะเยอทะยานสูง ใฝ่ฝันต่อความก้าวหน้าอย่างเร่าร้อนรุนแรง มักประสบ ความสำเร็จในชีวิตได้ด้วยตนเอง แต่จะเหนื่อยมากกว่าปกติ ถึงทำงานในตำแหน่งใหญ่โตมีลูกน้องบริวารพรั่งพร้อม ก็มักต้องลงแรงเหนื่อยยากเอาเองจึงจะสำเร็จ มักตัดสินใจอะไรในลักษณะ เด็ดเดี่ยวแข็งกร้าว กล้าที่จะตัดสินใจต่อเหตุการณ์ร้ายแรงเด็ดขาดโดยไม่คาดฝันมาก่อน",
  12: "ความเปลี่ยนแปลง : เป็นคู่ของดวงอาทิตย์ (1) และดาวจันทร์ (2) ธาตุไฟกับธาตุน้ำจึงรวมอยู่ในบุคลิกเดียวกัน ทำให้เป็นที่มี อารมณ์ขัดแย้งกันในตัวเอง เหมือนเป็นคนมี 2 บุคลิกในร่างเดียวกัน บางเวลาก็เป็นคนเข้มแข็ง กล้าหาญ มีความเป็นผู้นำ เอาจริงเอาจังมากทีเดียว แต่บางเวลาก็หม่นหมอง ขลาดกลัว หลงเชื่อคำยุยงง่าย หากอยู่ในตำแหน่งสูง จะทำให้ชีวิจเกิดความไม่แน่นอน หากลุ่มหลงใคร มักจะลืมหูลืมตาไม่ขึ้นเลยทีเดียว ดาวอาทิตย์ 1 ร่วมดาวจันทร์ 2 : จะอยู่ราศีใดก็ตาม เรียกว่า จันทร์ดับ",
  13: "ฝันที่ไม่เป็นจริง : เป็นคู่ของดาวอาทิตย์ (1) และดาวอังคาร (3) ปกติแล้วคนส่วนใหญ่มักคิดว่า เลข 13 เป็นเลขที่ไม่ดี เป็นดาวคู่ศัตรู เมื่อมาอยูร่วมกันทำให้เกิดอิทธิพลได้ทั้งเรื่องดีและเรื่อง ร้ายเกิดขึ้นได้อย่างฉับพลัน คือ จะให้คุณและโทษอย่างรวดเร็ว มักจะเกิดอุบัติเหตุอย่างฉับพลัน ดังนั้นบุคคลเลข 13 จึงมักจะมีการเปลี่ยนแปลงอย่างรวดเร็วทั้งดีและร้าย ส่วนพิเศษ คือมักจะส่งผลดีอย่างรวดเร็ว ทำให้มีโชคมีชื่อเสียงเป็นที่นับหน้าถือตา มีโชคลาภหรือชื่อเสียงได้อย่างไม่คาดคิด มีความคิดแปลกแหวกแนวไม่เหมือนใคร ชอบการเปลี่ยนแปลงใหม่ๆ กล้าแบบไม่ต้องกลัวใคร จึงมักส่งผลให้เกิดอันตราย ในบั้นปลาย ต้องระมัดระวังเรื่องอุบัติเหตุ การผ่าตัด ถูกอาวุธ ถูกศัตรูทำร้าย ครอบครัวมีปัญหาแตกร้าว ไม่ปกติสุข ผู้ใหญ่ให้โทษ ถึงกับไม่มีตึกชั้น 13 หรือห้องที่ 13 เลยทีเดียว",
  14: "ผู้ยิ่งใหญ่ : เป็นคู่ของดาวอาทิตย์ (1) และดาวพุธ (4) บ่งบอกถึงความเป็นคนรุ่นใหม่ไฟแรง มีสติ ปัญญาไหวพริบดี มักจะส่งเสริมให้ชีวิตมีความรุ่งโรจน์อย่างมั่นคง ไฟแห่งดาวอาทิตย์ช่วยสนับสนุนให้สมองเฉียบแหลมว่องไว เป็นคนชอบคิดชอบค้นและจดจำสิ่งต่างๆได้อย่างแม่นยำ ชอบการประดิษฐ์ กล้าคิดกล้านำเสนอ รักความยุติธรรม สามารถสร้างเนื้อสร้างตัวได้แบบยั่งยืน มีข้อเสีย คือ ค่อนข้างเจ้าระเบียบ บางครั้งก็เชื่อมั่นยึดถือบรรทัดฐานของตนเองมากเกินไป แต่ก็ไม่ถึงกับเสียหายแต่อย่างใด เพราะได้อิทธิพลจากดาวพฤหัสบดี เพราะเลข 1+4 ได้ 5 ทำให้เข้าใจได้ทั้งโลกีย์ปัญญา (ความรู้สำหรับหากิน) และโลกุตรปัญญา (ความเข้าใจในโลกและชีวิต) ถือเป็นเลขที่ดีที่สุดเลขหนึ่งทีเดียว",
  15: "ความสุนทรีมีปัญญาดี : เป็นคู่ของดาวอาทิตย์ (1) และดาวพฤหัส (5) เป็นกำลังของดาวจันทร์ (2) มักจะเป็นคนมีเสน่ห์ มีปฏิภาณว่องไว เข้ากับคนได้ทุกระดับ อ่านใจคนเก่ง มักจะมีผู้ใหญ่ให้การอุปถัมภ์ค้ำจุนช่วยเหลือตลอด มักจะได้รับของตอบแทน ทั้งสิ่งของและการเงินจากบุคคลอื่นเสมอ บุคคลเลข 15 เป็นนักพูดชั้นดี มีคารมดึงดูดเร้าใจผู้อื่น เหมาะกับอาชีพนักปกครอง นักบริหาร เลข 15 บวกกันได้เลข 6 คือ ดาวศุกร์ เห็นคนมีแนวโน้มไปทางศิลปะ รักศิลปะ รักสวยรักงาม ชอบความรื่นรมย์ มีพรสวรรค์ มักมองโลกในแง่ดีเสมอ ไม่ชอบเก็บตัว ไม่ชอบความทุกข์เป็นคนมีมิตรสหายมาก ใจกว้าง ถือเป็นเลขดี",
  16: "ผู้ปราชัย : เป็นคู่ของดาวอาทิตย์ (1) และดาวศุกร์ (6) อันที่จริงแล้ว เลขทั้ง 2 ตัวนี้เป็นเลขดี แต่เมื่อรวมกันแล้วได้เท่ากับ 7 คือ ดาวเสาร์ เป็นเลขแห่งความทุกข์ อุปสรรค อับโชค บุคคลใต้อิทธิพล 16 จึงมักประสบโชคร้ายก่อน จึงจะพบความสำเร็จภายหลัง บางรายกว่าจะพบความสำเร็จได้ต้องฟันฝ่าอุปสรรคนา นับประการ จุดเด่นของเลข 16 คือ ส่งเสริมให้ชีวิตพบกับความสำเร็จอย่างผาดโผน มีชื่อเสียง มีอำนาจแบบชนิดไม่คิดฝัน แต่ระวังปัญหาต่างๆ ที่จะเกิดอย่างไม่คาดฝันเช่นกัน",
  17: "อำนาจที่ถูกริดรอน : เป็นคู่ของดาวอาทิตย์ (1) และดาวเสาร์ (7) คุ้มโทษคุ้มภัยได้ มักจะมีสติปัญญาแตกฉาน เข้าใจอะไรได้ง่าย สามารถหยั่งรู้เหตุการณ์ล่วงหน้าได้อย่างรวดเร็วแต่ชีวิตมักจะพบอุปสรรค และความยุ่งอยากอยู่บ่อยๆมักจะถูกผู้ใหญ่กดดันและให้โทษ ทำให้ชีวิตขึ้นๆ ลงๆ ไม่แน่นอน บุคคลในเลข 17 นี้ จะมีตำแหน่งสูง แต่มักจะตกจากตำแหน่งได้ง่าย หรือไม่ก็มักจะถูกแย่งตำแหน่ง หน้าที่การงานมักจะไม่ยั่งยืนถาวร เมื่อยามรุ่งโรจน์ต้องอย่าเหลิง เมื่อถึงคราวตกต่ำก็อย่าเสียใจจนเกินกว่าเหตุ ทำใจให้สงบ ถือว่าเป็นกฎแห่งกรรม เลข 17 มักจะผิดหวังชอกช้ำในเรื่องความรักเสมอเลข 17 รวมกันได้ 8 คือ พระราหู มักจะเป็นคนหูเบาเชื่อคนง่ายค่อนข้างดื้อรั้นเอาแต่ใจตัวเอง เวลาหลงอะไร ก็จะหลงแบบมากๆ ลืมหูลืมตาไม่ขึ้น แถมยังขี้น้อยใจอีกต่างหาก",
  18: "บทพิสูจน์ : เป็นคู่ของดาวอาทิตย์ (1) และดาวราหู (8) ชีวิตมักจะไม่แน่นอน ไม่คงที่คงวา มีการโยกย้ายอยู่บ่อยๆ ชีวิตที่รุ่งโรจน์รุ่งเรือง มักตกต่ำลง บุคคลในเลข ๑๘ จึงไม่เหมาะกับอาชีพที่ทำงานอยู่กับที่ควรหางานที่ต้องเดินทางจะเหมาะสมกว่า ชีวิตมักจะพบกับสิ่งไม่คาดคิดอยู่เสมอ ควรจะทำอะไรอย่างรอบคอบ ชีวิตมักจะถูกกดดันและถูกคุกคามจากผู้มีอำนาจเร้นลับ จากผู้ไม่เป็นธรรม มักถูกศัตรูปองร้าย ชีวิตครอบครัวมักแตกร้าวการทะเลาะวิวาท ทำให้ชีวิตตกพุ่มหม้าย หรือไร้คู่มักจะพบความขมขื่นในเรื่องความรัก ผิดหวัง หรือต้องพลัดพรากจากกันเสมอ บุคคลในเลข 18 จึงไม่เหมาะกับการทำงานเสี่ยง ควรหลีกเลี่ยง จุดสำคัญของอิทธิพลเลขนี้คือ ปัญหาเรื่องคู่ ปัญหาเรื่องหย่าร้าง ถ้ายังเป็นคู่มักอกไหม้ไส้ตรม",
  19: "ผู้เสวยสุข : เป็นคู่ของดาวอาทิตย์ (1) และดาวเกตุ (9) เลข 19 เป็นกำลังของดาวพฤหัสบดีทางทักษา ส่งผลให้ชอบศึกษาหาความรู้ ชีวิตมักประสบความสำเร็จ ได้รับความอุปการะจากผู้ใหญ่ เลข 19 ถือว่าเป็นเลขนำโชคเลขหนึ่งส่งเสริมให้ชีวิตประสบความสำเร็จอย่างงดงาม จะได้รับเกียรติอย่างสูงในสังคม ส่งผลดีให้กับอนาคตพบกับความสำเร็จที่ยิ่งใหญ่ เลข 19 นี้ไม่เหมาะกับสุภาพสตรี จะทำให้ตกพุ่มหม้ายกำพร้าพ่อก่อนแม่ บางครั้งส่งผลให้สามีตกจากตำแหน่ง หรือถูกแย่งงาน ชีวิตมักมีปัญหาเรื่องคู่ กดดันจนทำให้เป็นคนไร้คู่ หรือไม่ต้องการเป็นเมียน้อย กินน้ำใต้ศอกคนอื่น อิทธิพลของเลข 19 ถึงจะส่งผลดีมากแต่ก็มีจุดเสียคือ มักจะดีไม่ค่อยตลอด จึงควรระมัดระวัง หากทำงานใหญ่ต้องรอบคอบ",
  20: "คิดการใหญ่ : เป็นคู่ของดาวจันทร์ (2) และดาวมฤตยู (0) มักมีจินตนาการกว้างไกล ไกลมาก จนบางครั้งเป็นคนเพ้อฝัน ชอบการปฏิรูปเปลี่ยนแปลงไม่ชอบหยุดนิ่งอยู่กับที่ ชอบไขว่คว้าแต่ที่สูงสุดเอื้อม จนกลายเป็นเรื่องละเมิดสิทธิของคนอื่น แต่อย่างไรก็ตาม อิทธิพลของเลข 20 ก็ช่วยส่งเสริมให้การเพ้อผันเพิ่มกำลังเป็น 2 เท่า กลายเป็นคนมีความทะเยอทะยาน เป็นคนมีความกระตือรือร้นอย่างรุนแรง ชอบวิธีการใหม่ โดยไม่ชอบย่ำเท้าอยู่กับที่ กล้าเสี่ยงกล้าลอง จนบางครั้งทำให้ความคิดใหญ่โตเกินไป เพราะเชื่อว่าสิ่งที่ตัวเองจะทำจะต้องสำเร็จ ผู้ตกอยู่ใต้อิทธิพลเลขนี้ จะได้ผู้บังคับบัญชาที่ดี มีความรอบคอบ ชีวิตจะประสบความสำเร็จดีเยี่ยม และหากทำงานด้วยตัวเองมักจะสำเร็จยาก เพราะสิ่งที่คิดมักทำคนเดียวไม่ได้ เป็นนักคิดฝันแต่โครงการใหญ่ๆ ถ้าหากขาดกำลังสนับสนุนย่อมสำเร็จได้ยากตามความคิด มักมีลางสังหรณ์แม่น",
  21: "ความพลิกผัน : เป็นคู่ของดาวจันทร์ (2) และดาวอาทิตย์ (1) เป็นคู่ของราชินีและราชาแห่งจักรวาล เป็นคนมีเสน่ห์ เข้าสังคมเก่ง มักจะเป็นคนเด่น มีคนยกย่องให้เกียรติ มักเป็นบุคคลสองลักษณะในตนเองคือ การแสดงออกภายนอก มักจะดูอ่อนแอ แต่จริงๆแล้วสภาพภายในเป็นคนกล้าแข็ง เรียกว่าเป็นคนซ่อนบุคลิกของตัวเองได้อย่างแนบเนียน ยากที่ใครจะอ่านใจได้ จึงมักจะมีความนิ่มนวล อ่อนไหวง่ายแต่ขณะเดียวกันก็แฝงไว้ด้วยความหยิ่ง ถือตัว เอาแต่ใจตัวเอง สามารถเข้ากับใครก็ได้ แต่เบื้องหลังเป็นคนเด็ดเดี่ยวกล้าตัดสินใจ ชีวิตจะต้องระวังจุดแตกหักกลางคัน ทำให้เกิดมุมหักง่าย มักจะมีสิ่งไม่คาดคิดเกิดแบบเฉียบพลัน มาเปลี่ยนรูปแบบเบี่ยงเบนวิถีชีวิตให้เปลี่ยนไปในทางตรงกันข้าม บ่งถึงความไม่แน่นอนในอนาคต",
  22: "ความเชื่อที่ผิดๆ : เป็นดาวจันทร์ (2) ซ้อนกันสองดวง หมายถึง ความเป็นนักปราชญ์ ผู้รู้ ผู้มีซิกซ์เซนส์ดี มีความรอบรู้ในด้านศิลปวิทยาการหลายแขนง มักทำหน้าที่ให้คำแนะนำปรึกษา หรือแก้ไขปัญหาให้คนอื่น เป็นคนไม่ค่อยมีความกระตือรือร้นและทะเยอทะยานมากนัก แต่เนื่องจากดาวจันทร์เป็นประธานฝ่ายกลางคืน ทำให้ชีวิตพลิกผันไปในทางด้านร้ายได้ง่าย ถ้าไม่ระมัดระวัง มักจะถูกหลอกลวงได้ง่าย ข้อเสียอีกอย่างหนึ่ง คือ มักดื้อรั้นไม่ค่อยเชื่อฟังใคร เป็นไปได้ว่า อาจหลงใหลในเรื่องศาสตร์เร้นลับต่างๆ",
  23: "ยอดเสน่ห์ : เป็นคู่ของดาวจันทร์ (2) และดาวอังคาร (3) เรียกว่า ‘คู่ชู้สวาท หรือคู่อิจฉาริษยา’ เป็นเลขดีทางด้านการศึกษาหาความรู้ เพราะรวมกันแล้วได้เลข 5  เป็นผู้รอบรู้ในวงกว้าง ชอบเป็นผู้สั่งสอน หรือถ่ายทอดให้ความรู้คนอื่น มักมีคนอุปถัมภ์ช่วยเหลือ โดยเฉพาะผู้หญิงถ้าได้เลขนี้ จะมีผู้หลักผู้ใหญ่หรือคนที่มีอิทธิพลคอยสนับสนุน ชีวิตอาจขึ้นๆลงๆได้บ้างในบางช่วงของวัย ขึ้นอยู่กับเศรษฐกิจและการเมือง ถ้าเป็นชาย ต้องระวังเรื่องความเสียหายในเรื่องชู้สาว และปัญหาในเรื่องเพศตรงข้ามเอาไว้ด้วย เนื่องจากเลข ๒ ของจันทร์ที่นำหน้านั้น เป็นเลขที่เด่นในด้านซับซ้อนซ่อนเร้น และเรื่องความรักที่ไม่เปิดเผย",
  24: "สมบูรณ์สุข : เป็นคู่ของดาวจันทร์ (2) และดาวพุธ (4) เป็นเลขดี ไม่มีส่วนเสีย เลข 24 เป็นดาวคู่มิตร จึงทำให้เป็นคนมีเพื่อนมาก และเพื่อนฝูงมักจะให้การอุปถัมภ์ค้ำชูเป็นอย่างดี เป็นคนมีกิริยามารยาท นุ่มนวลเป็นที่รักของคนทั่วไป เป็นคนมีสติปัญญาว่องไวแตกฉาน มีเสน่ห์รุนแรง เป็นคนหยั่งรู้การณ์ไกล เข้าใจสิ่งแวดล้อมรอบตัวได้อย่างรวดเร็ว เป็นคนละเอียดละอ่อน ไม่ฉาบฉวย เข้าถึงอารมณ์ศิลป์ ไม่ชอบแสดงอำนาจ มักจะมีโชคลาภได้รับความช่วยเหลือจากบุคคลอื่น เลข 24 บวกกันได้ เลข 6 เป็นดาวแห่งศิลปิน ใครที่เป็นศิลปินอยู่จะได้เป็นศิลปินเอก สามารถแสดงอารมณ์ความรู้สึกได้อย่างดีเยี่ยม เลข 24 ยังเหมาะกับการค้า เพราะมีความชำนาญงาน ปฏิภาณเฉียบแหลม เข้าใจงานอย่างลึกซึ้งเอาใจใส่ เข้ากับใครๆ ได้ง่าย",
  25: "มีทั้งทุกข์และสุข : เป็นคู่ของดาวจันทร์ (2) และดาวพฤหัส (5) จัดเป็นดาวศุภเคราะห์ทั้งคู่ ดูเผินๆ เป็นเลขดีแต่กว่าจะสำเร็จต้องผ่านอุปสรรคและการต่อสู้อย่างเหน็ดหนื่อย ต้องอาศัยความขยันหมั่นเพียร และฟันฝ่าอุปสรรคต่างๆ ด้วยลำแข้งของตัวเองจึงจะบรรลุความสำเร็จดังที่ต้องการ บุคคลเลข 25 มีทั้งดีและร้ายด้านดี คือ บ่งถึงความมั่นคงในชีวิต มีคนให้ความช่วยเหลือ มีความสำเร็จคอยอยู่อย่างแน่นอน มีผู้ใหญ่คอยให้การอุปถัมภ์ ในด้านความรักทำให้ลุล่วงไปด้วยดี ในแง่ร้าย จะส่งผลให้ชีวิตพบกับสภาวะคับขันและสำคัญอย่างสุดขีด ถูกศัตรูปองร้าย ถูกกลั่นแกล้ง ถูกอำนาจมืดคุกคาม ทำให้ชีวิตพบกับความฝันผันผวนอย่างรุนแรง และบางครั้งอาจถูกศัตรูทำลายถึงแก่ชีวิต เพราะอิทธิพลของ เลข 2 ธาตุน้ำ เลข 5 ธาตุไฟ ที่เป็นศัตรูทำลายกัน",
  26: "การถูกครอบงำ : เป็นคู่ของดาวจันทร์ (2) และดาวศุกร์ (6) เรียกว่า คู่จันทร์อภิรมย์ บ่งถึงความสำเร็จ แต่ในความสำเร็จนั้นมักจะได้มาไม่ค่อยยั่งยืนถาวร เช่น ความสำเร็จจากงานเสี่ยง การประมูลงาน หรือความสำเร็จประเภทปิดทองหลังพระ มักจะเป็นคนเพ้อฟัน ความรักสดชื่น เป็นคนมีอารมณ์ศิลป์ มีฝีมือละเอียดอ่อน มีมารยาทนุ่มนวล เป็นคนมีรสนิยมสูง สามารถสร้างชื่อเสียงได้จากงานด้านศิลปะ งานบันเทิงทุกแขนง หรืองานกลางคืนประเภทเอนตอร์เทนท์ทั้งหลาย เป็นเลขของผู้มีความคิด 2 ด้าน เหมือนมี 2 คนในร่างเดียว ต้องระวังการลุ่มหลงมัวเมาในแสงสีหรือสิ่งยั่วยุต่างๆ เอาไว้ด้วย โดยเฉพาะคนที่ทำงานอยู่กับความไม่แน่นอน เพราะอิทธิพลของดาว 8 (2+6) ดาวราหูนั่นเอง",
  27: "ผู้สูญเสีย : เป็นคู่ของดาวจันทร์ (2) และดาวเสาร์ (7) ชีวิตจะพบกับความสำเร็จอย่างงดงาม บุคคลหมายเลข 27 มักจะมีความคิดเห็นเป็นของตนเอง การดำเนินชีวิตมักจะเป็นไปอย่างรัดกุม บ่งถึงความโชคดีในอนาคตแต่ชีวิตมักจะมีความกดดันอย่างรุนแรงจากเลข 7 ทำให้เหมือนคนอมทุกข์ มีโรคภัย ไข้เจ็บแทรกเป็นประจำตัวมักผิดหวังจากสตรี ชีวิตมักจะแอบแฝงไปด้วย ความเศร้ามักประสบโชคร้ายอย่างกะทันหัน ต้องสูญเสียบุคคลที่รักไปในช่วงรุ่งเรืองของชีวิต เช่น บิดาหรือคู่ครอง บุคคลเลข 27 มักเป็นคนเข้มงวดในการดำเนินชีวิตอย่างมาก จนกลายเป็นคนเอาจริงเอาจังต่อชีวิตมากไป เลข 27 นี้ต้องระวังอิทธิพล ทำให้เกิดการผ่าตัด และอุบัติเหตุ",
  28: "คนห่างไกล : เป็นคู่ของดาวจันทร์ (2) และดาวราหู (8) เป็นเลขแห่งความผันผวน มีเรื่องทุกข์อกทุกข์ใจ ขมขื่น ผิดหวัง ควบคุมให้โทษอยู่อย่างใกล้ชิด เป็นเลขที่ส่งผลเสียให้กับชีวิตมากกว่าดี เป็นคนกล้าได้กล้าเสีย ชอบทำงานใหญ่โดยไม่ไตร่ตรอง ชอบคิดค้นของใหม่ๆ ไม่ชอบย่ำเท้าอยู่กับที่ เป็นคนเบื่อง่าย ไม่ชอบสิ่งที่จำเจ ชอบเสี่ยงโชคต่างถิ่นหรือแดนไกล เป็นคนเชื่อมั่นในตัวเอง แต่ไม่ไว้ใจผู้อื่น ในชีวิตจึงเต็มไปด้วยความขัดแย้ง ชอบริเริ่มแต่ไม่ชอบรับผิดชอบ จึงทำให้การดำเนินชีวิตไม่ค่อยเป็นระเบียบ ทำให้ชีวิตต้องเริ่มต้นใหม่อย่างซ้ำซาก และเป็นคนไม่ค่อยสนใจต่ออดีตที่ผ่านมา เป็นคนที่เหมือนคนอมทุกข์ มักจะมีเรื่องกลุ้มใจขมขื่นผิดหวังแอบแฝงอยู่ ชีวิตมักจะมีเบื้องหลังไม่ค่อยดี ทำให้คนติฉินนินทา มักจะกำพร้าหรือผิดหวังในเรื่องความรัก ทำให้พัดพรากจากมารดาไปเสี่ยงโชคยังต่างแดน",
  29: "ผู้ถูกกำหนด : เป็นคู่ของดาวจันทร์ (2) และดาวเกตุ (9) ชอบทำตัวเป็นคนเร้นลับไม่เปิดเผยบ่งถึงความกดดันจากอำนาจ อิทธิพลเร้นลับ เป็นคนชอบอาฆาต จนบางครั้งกลายเป็นคนอำมหิต ชีวิตมักจะหักกลาง ถูกปองร้ายจากศัตรู ถูกผู้อื่นโค่นอำนาจได้ง่ายและมักจะแพ้ภัยแก่ศัตรู และยังต้องระมัดระวังภัยจากอุบัติเหตุ เลข 29 ทำให้ชีวิตอมทุกข์ผิดหวังจากสุภาพสตรี จะทำให้ชีวิตระทมแอบแฝงอยู่ แต่เลข 29 บวกกันได้ 11 จึงเป็นคนทะเยอทะยานอย่างแรงกล้า ไม่ยอมคน เป็นคนมั่นใจในตนเอง ถือตัว และหยิ่ง ชอบดูถูกคนอื่น ชอบเอาแต่ใจตัวเองแบบเผด็จการ ดูภายนอกสดใส แต่ภายในอมทุกข์ การแสดงออกมักไม่ตรงกับใจตัวเอง จึงบ่งถึงความไม่แน่นอน มักจะถูกหลอกลวงจากบุคคลอื่น ต้องระวังเพื่อนที่ไม่ซื่อ และจะมีทุกข์เพราะสตรี จะบ่งถึงอันตรายในอนาคต ไม่ควรประมาท",
  30: "ถอยหลังเข้าคลอง : ดาวอังคาร (3) กับดาวมฤตยู (0) คู่กัน เป็นดาวอุบัติเหตุที่แท้จริง บุคคลเลข 30 มักจะไม่หยุดนิ่งอยู่กับที่ สามารถส่งผลให้รุ่งโรจน์อย่างโลดโผนมากแต่ในขณะเดียวกัน ความรุ่งโรจน์ก็อาจล้มครืนลงมาอย่างฉับพลันเหมือนวิมานพังทลายโดยอาจมาจาก สาเหตุของสุขภาพร่างกายไม่ค่อยดี เกิดล้มเจ็บอย่างกะทันหัน หรือเกิดอุบัติเหตุได้รับอันตรายอย่างปัจจุบันทันด่วน ผู้อยู่ในอิทธิพลเลข 30 ต้องระมัดระวังเรื่องอุบัติเหตุ การผ่าตัด และเหตุร้ายแรงอย่างฉับพลันไม่ควรประมาท เป็นคนคิดทำอะไรง่ายๆ ไม่มองการณ์ไกล จนบางครั้งเป็นคนถอยหลังเข้าคลอง",
  31: "ทุกข์ซ้ำซาก : เป็นคู่ของดาวอังคาร (3) และดาวอาทิตย์ (1) เรียกว่า คู่อุบัติเหตุ หรือคู่ทะเยอทะยาน ชีวิตมักจะโชคร้ายในเบื้องต้นและประสบความสำเร็จในบั้นปลาย บุคคลใต้อิทธิพลเลขนี้ ชีวิตมักจะหักกลาง มักประสบเรื่องสะเทือนใจอย่างแรงในชีวิต มักมีเรื่องอื้อฉาว ความรักหักกลางคัน ชีวิตสมรสไม่แน่นอน เลข 31 ยังต้องระวังเรื่องอุบัติเหตุ การผ่าตัด การถูกแย่งชิงตำแหน่งหน้าที่การงานด้วย ทำอะไรมักไม่ค่อยราบรื่น ส่วนมากมักจะมีอุปสรรคมาคอยขัดขวางอยู่เสมอ ใครตกอยู่ใต้อิทธิพลเลขนี้ ต้องรอบคอบระมัดระวังเพราะ ธาตุน้ำกับธาตุไฟ อยู่รวมกันทำอะไรมักจะให้สมดุลกันยาก",
  32: "เสน่ห์แรง : เป็นคู่ของดาวอังคาร (3) และดาวจันทร์ (2) เรียกว่า เป็นดาวคู่ชู้ บ้างก็ว่าเป็นคู่อิจฉาริษยา บุคคลเลขนี้ดี ทางด้านความสัมพันธ์ระหว่างเพศ บ่งบอกถึงความเป็นคนเจ้าชู้มีเสน่ห์ เป็นคนที่ยึดมั่นในความคิดและอุดมการณ์ของตนเอง งานทุกอย่างหากไม่ทำเอง มักจะประสบความล้มเหลวบุคคลเลข 32 มักจะต้นร้ายปลายดี ชีวิตมักจะมีอุบัติเหตุหรือโรคภัยไข้เจ็บเบียดเบียนอย่างเรื้อรัง ถ้าเป็นชายระวังจะถูกผู้หญิงสร้างปัญหาความทุกข์อย่างร้ายแรงให้ หรือสุขภาพไม่ค่อยดี มักจะกำพร้ามารดา แต่มีผู้ใหญ่ให้ความอุปถัมภ์ สนใจแสวงหาความรู้ดี",
  33: "เจ้าอารมณ์ : เป็นเลขของดาวอังคาร (3) สองดวง เปรียบเสมือนแม่น้ำใหญ่อันเชี่ยวกรากและรุนแรงสองสาย ไหลมาบรรจบพบกัน ดังนั้นบุคคลที่ได้รับอิทธิพลของเลขนี้ ถ้าดาวเคราะห์ในดวงชะตาสถิตในราศีและภพที่ให้คุณ ก็ให้คุณทบเท่าทวีคูณเป็นสองเท่า ถ้าเป็นคนกล้าหาญ ก็จะมีความกล้าเพิ่มมากขึ้น ถ้าเป็นคนขยัน ก็จะมีความขยันหมั่นเพียร เอาการเอางานเพิ่มมากขึ้นเป็นสองเท่า มีความเป็นนักกีฬามากขึ้น สุขภาพสมบูรณ์แข็งแรง ปราศจากโรคภัยไข้เจ็บเบียดเบียน ถ้าดาวเคราะห์ในดวงชะตาสถิตในราศีและภพที่ให้โทษ ก็ให้โทษเป็นสองเท่า ทำให้เป็นคนที่อารมณ์ฉุนเฉียว เร่าร้อน รุนแรง ทำอะไรชอบเอาแต่ใจตัวเอง ไม่ยอมยับยั้งใดๆ ทั้งสิ้น จะดันทุรังเอาให้ได้แบบหัวชนฝา เลข 3 เป็นดาวอุบัติเหตุมารวมกันถึงสองดวง ต้องระวังอันตรายแบบฉับพลันมักประสบอุบัติเหตุ และมักเกิดอันตรายเกี่ยวกับความเร็ว การกระทบกระทั่ง การวิวาท บุคคลในเลข 33 เป็นคนที่บ่งถึงความมีอารมณ์ในโลกีย์รุนแรง มีความปรารถนาอันเร่าร้อน เลข 33 เป็นเลขร้าย ถ้าดาวอังคารในดวงชะตาสถิตในตำแหน่งที่เสีย จะส่งผลร้าย จึงไม่ควรประมาท",
  34: "ความคับขัน : เป็นคู่ของดาวอังคาร (3) และดาวพุธ (4) เรียกว่า คู่วาทะ หรือคู่ทฤษฎีคู่ปฎิบัติ เป็นคนมีสติปัญญาแตกฉาน ว่องไว มีปฏิภาณดี เป็นบุคคลกล้าหาญ กล้าพูดกล้าทำ เป็นคนเปิดเผย แม้ชีวิตจะพบอุปสรรคมากมาย แต่ก็สามารถเอาตัวรอดไปได้ด้วยสติปัญญาของตัวเองเสมอ ชีวิตในวัยเด็กของบุคคลเลข 34 มักประสบอุบัติเหตุ และโรคฟัน และบาดเจ็บจากเขี้ยวงา ต้องระวังอย่างมากเกี่ยวกับโรคทางประสาท และเกี่ยวกับทางสมอง โดยสมองอาจจะได้รับความกระทบกระเทือนอย่างรุนแรงได้",
  35: "เด็ดเดี่ยวตั้งมั่นจริงจัง : เป็นคู่ของดาวอังคาร (3) และดาวพฤหัส (5) เรียกว่าคู่สมพล รวมกันได้เลข 8 พระราหู เป็นเลขที่ไม่น่าไว้วางใจนัก ต้องระวังอันตรายเกี่ยวกับผู้ใหญ่ ผู้ปกครองบุคคลหมายเลข 35 มักจะกำพร้า และอาศัยผู้ใหญ่เป็นเครื่องเชิดชูความเป็นอยู่ของตนเอง เลข 35 ถึงแม้ว่าจะเป็นเลขไม่น่าไว้วางใจ แต่ก็ให้คุณในด้านเป็นคนกระฉับกระเฉงคล่องงานรอบตัว มีพรสวรรค์เข้ากับคนได้ทุกระดับชั้นชีวิตบั้นปลายจะประสบความสำเร็จดี จะมีผู้ใหญ่ให้การอุปถัมภ์ค้ำชู แต่ต้องระวังการหลงผิด หูเบา เชื่อใจคนง่าย อันจะเป็นส่วนทำให้เสียหายภายหลัง",
  36: "ไม่ขาดเงินทองและความรัก : เป็นดาวคู่มิตร คู่ของดาวอังคาร (3) และดาวศุกร์ (6) เป็นเลขที่หมายถึง ความรัก ความสดชื่นของชีวิต ชีวิตจะประสบความสำเร็จเป็นอย่างดี มีมิตรสหายมาก เพศตรงข้ามมักจะให้ความอบอุ่นเป็นอย่างดี แต่เป็นคนเจ้าอารมณ์ มีความคิดเห็นรุนแรง ชีวิตในวัยแห่งความรักมักจะโลดโผน เลข 3+6 ได้เลข 9 เป็นเลขแห่งสิ่งศักดิ์สิทธิ์ มีญาณสังหรณ์ที่แม่นยำ เลื่อมใสศรัทธาในศาสตร์เร้นลับ เชื่อกันว่า เลข 9 เป็นเลขที่คุ้มภัยให้แคล้วคลาด และยังช่วยให่อายุมั่นขวัญยืน ให้ชีวิตความเป็นอยู่ที่ดี ถือเป็นเลขดีมากเลขหนึ่ง",
  37: "ผู้สูญสิ้น : เป็นคู่ของดาวอังคาร (3) และดาวเสาร์ (7) ถือว่าเป็นเลขที่น่ากลัว เป็นเลขร้าย ถ้าเกี่ยวข้องกับผู้ใดให้พึงระวังการทะเลาะวิวาท ความวิบัติอันรุนแรง การขัดแย้งกัน ตลอดจนโรคร้ายทรมาน การผ่าตัดอุบัติเหตุ ความเสียหายอย่างรวดเร็วรุนแรง ชีวิตมีมุมหักเหอยู่ตลอดเวลามักจะขึ้นๆ ลงๆ ไม่ค่อยราบรื่นนัก มักเกี่ยวข้องกับความตาย",
  38: "ความล้มเหลวที่ไม่อาจหยุดยั้ง เจ้าโทสะ : เป็นคู่ของดาวอังคาร (3) และดาวราหู (8) เป็นเลขร้ายอีกเช่นกัน แสดงถึงถูกอำนาจของความลุ่มหลงโมหะจริตเข้าครอบงำ การใช้อารมณ์ชอบถืออำนาจเป็นธรรม มักพบกับความผันผวนในชีวิตอย่างรุนแรง ชอบคลุกคลีอยู่กับนักเลงหัวไม้ ตำรวจ อันธพาล บุคคลเลข 38 ต้องระวังเรื่องวิญญาณและเจ้าที่เจ้าทาง ค่อนข้างจะรุนแรงเอาการ หากไปลุ่มหลงจะถอนตัวไม่ขึ้น",
  39: "ที่รองรับอารมณ์ : เป็นคู่ของดาวอังคาร (3) และดาวเกตุ (9) ถือเป็นเลขกลางๆ มักจะพบกับความยุ่งยากในชีวิตอยู่บ่อยๆ และจะพบกับการกระทบกระเทือนใจอย่างรุนแรง ความกดดันจิตใจเมื่อถึงขีดสุดก็อาจจะวิปริตไปได้ง่ายๆ ให้ระวังมือที่สามจะเข้ามาก้าวก่ายในชีวิต บุคคลเลข 39 มักจะมีมิตรสหายมาก และมิตรสนิทจะให้การเกื้อกูลได้เป็นอย่าง",
  40: "ชอบเดินทาง : เป็นคู่ของดาวพุธ (4) และดาวมฤตยู (0) ถือเป็นเลขดี เป็นเลขอิทธิพลที่ได้รับจากเลข 0 ดาวมฤตยูเข้ามาพัวพัน จึงทำให้บุคคลเลข 40 มักจะเพ้อฝันถึงสิ่งแปลกๆ ชอบสิ่งเร้นลับมหัศจรรย์ มีรสนิยมแปลกๆ ชอบสร้างความประหลาดใจให้แก่วงสังคมอยู่เสมอ ส่วนใหญ่เชื่อใจคนง่าย มักชอบเดินทาง ชอบเปลี่ยนที่อยู่บ่อย ๆ ชอบคิดชอบค้นของแปลกใหม่ๆ ดาวพุธ (4) หมายถึง สติปัญญา แต่ปัญญาแบบพุธ เป็น ‘โลกีย์ปัญญา’ ปัญญาเลี้ยงปากเลี้ยงท้อง ปัญญาในทางโลก มีปฎิภาณเฉลียวฉลาด ว่องไว ทันคน ชอบติดต่อคบหาสมาคม เข้าไหนเข้าได้ เรียกว่ามีมนุษย์สัมพันธ์เป็นเลิศ ว่างั้นเถอะ",
  41: "ความผูกพันกับต่างประเทศ : เป็นคู่ของดาวพุธ (4) และดาวอาทิตย์ (1) เป็นเลขดีเกือบร้อยเปอร์เซ็นต์ บ่งถึงความสำเร็จในชีวิตเป็นอย่างดี ผู้ใหญ่มักให้การอุปถัมภ์ สติปัญญาว่องไว มีสมองปราดเปรื่อง จะนำพาไปสู่ความสำเร็จที่ยิ่งใหญ่  มีความสุขุมล้ำลึก ตั้งแต่วัยเด็ก เป็นคนเข้ากับมิตรสหายได้อย่างสนิท แต่จะซ่อนความเป็นคนใฝ่ฝันทะเยอทะยานไว้ไม่ให้ใครเห็น มีโอกาสไปเกี่ยวข้องกับการต่างประเทศทุกรูปแบบเช่น การศึกษาต่างประเทศ  ท่องเที่ยวต่างประเทศ  อยู่หรือคบหากับคนต่างชาติ  สนใจธรรมะรักความยุติธรรม อาชีพที่เหมาะคือประชาสัมพันธ์ พบกับคนแปลกหน้าถึงจะดี",
  42: "ดวงอุปถัมภ์ ช่วยเหลือสนับสนุน : เป็นคู่ของดาวพุธ (4) และดาวจันทร์ (2) เป็นเลขดีเป็นดาวศุภเคราะห์ที่ให้คุณทั้งคู่  เป็นดาวคู่มิตร ชีวิต จะประสบความสำเร็จเป็นอย่างดี จะได้รับการสนับสนุนช่วยเหลือ เป็นที่รักและนับถือแก่คนทั่วไป เป็นคนมีเสน่ห์ ดึงดูดใจให้คนชอบพอรักใคร่ สุภาพโรแมนติก มีโชคดีเกี่ยวกับการเรื่องเงินๆทองๆ จะสามารถหามาได้โดยง่าย และเป็นดาวการเงิน มีเพื่อนและบริวารมาก เพื่อนฝูงมักให้การอุปถัมภ์ค้ำจุน เป็นที่รักของคนทั่วไป สติปัญญาดี เป็นนักพูดชั้นดี เหมาะกับอาชีพ นักปกครอง บริหาร นักการค้า เข้ากับใครได้ง่าย และได้รับความสุขในด้านความรัก เป็นหมายเลขที่ดีที่สุดเลขหนึ่ง",
  43: "ผู้พิชิตปัญหา ทุกข์ อุปสรรค : เป็นคู่ของดาวพุธ (4) และดาวอังคาร (3) เป็นเลขร้าย อับโชค เพราะ 43 รวมกันได้ 7 คือ ดาวเสาร์ บ่งบอกถึงความวิปริต มีศัตรู คอยจะกลั่นแกล้งอยู่เบื้องหลังตลอดเวลา และมีทุกข์อยู่เนืองๆ ชีวิตจะพบแต่อุปสรรค ความทุกข์ ความผิดหวังล้มเหลวอย่าประมาทเป็นอันขาด ชีวิตในวัยเด็กระยะทีนเอท อาจจะประสบอุบัติเหตุได้ง่าย แต่ทั้งนี้ต้องพิจารณาจากดาว 3 4 7 ในดวงชะตาด้วย เลข 3 คือ ดาวอังคาร ถ้าสถิตในตำแหน่งที่ดี เป็นดาวนักปฎิบัติที่มีความขยันหมั่นเพียร เลข 4 คือ ดาวพุธ เป็นดาวนักคิดนักเขียน เลข 43 เป็นดาวคู่นักคิดนักปฎิบัติ และถ้าเลข 7 ดาวเสาร์ในดวงชะตา สถิตในตำแหน่งที่ให้คุณ ก็ไม่เสียหายแต่อย่างใด กลับกลายเป็นคนที่มีความหนักแน่น อดทน สมถะ",
  44: "ฝีปากดี : เป็นเลขของดาวพุธ (4) เป็นเลขดีเลขหนึ่ง คนเลข 44 มักจะมีผู้อุปถัมภ์ช่วยเหลือ มีความสำเร็จในชีวิตพอสมควร ที่ต้องระวังคือ อิทธิพลของราหู (4 กับ 4 รวมเป็น 8) ทำให้มีโมหะจริต ลุ่มหลงมัวเมาอะไรได้ง่าย ขาดการยับยั้งชั่งใจในบางครั้ง ต้องระวังเรื่องใจอ่อน หลงในสิ่งดีก็เจริญ หลงในส่งผิดอนาคตจะดับลง ต้องรู้จักเหนี่ยวรั้งจิตใจไว้ไม่ให้หลงผิดได้ง่าย",
  45: "เทพีแห่งโชค : เป็นเลขของดาวพุธ (4) และดาวพฤหัส (5) เป็นดาวศุภเคราะห์ทั้งคู่ เป็นคู่ของนักปราชญ์ราชบัณฑิต เป็นเลขดีเกือบเต็มร้อย คนเลขนี้สติปัญญาเฉียบแหลม รู้ทั้งวิชาการทางโลกและทางธรรม มีความคิดความอ่านดี มีปฎิภาณไหวพริบดี ปรับตัวเข้าได้ทุกสภาพแวดล้อม มีสติมั่นคง ทำอะไรก็ได้รับความร่วมมือจากคนอื่น มักประสบความสำเร็จอย่างไม่คาดฝันเสมอ ทำอะไรก็ดี",
  46: "การแสวงหา : เป็นเลขของดาวพุธ (4) และดาวศุกร์ (6) เป็นดาวศุภเคราะห์ทั้งคู่ เป็นคู่ธาตุน้ำที่ให้คุณสูงทางด้านบุญฤทธิ์ ส่งเสริมให้มีความมั่นคงเป็นปึกแผ่น มากไปด้วยมิตรสหายคนรักใคร่ ชีวิตมีแนวโน้มประสบความสำเร็จดี ที่ควรระวังก็คือ มักเป็นคนใจอ่อน อาจตกอยู่ในการครอบงำของคนอื่นได้ง่าย อาจนำไปสู่ความหายนะ เลขคู่นี้ ถ้าให้โทษ ก็เป็นแบบนุ่มนวลค่อยไปเป็นค่อยไป ไม่ให้โทษแบบฉับพลันทันทีทันใด",
  47: "ชีวิตที่ต้องเหนื่อยเปล่า : เป็นคู่ของดาวพุธ (4) และดาวเสาร์ (7) เป็นเลขดี เข้มแข็งเลขหนึ่งเพราะ อิทธิพล เลข 7 ทำให้ชีวิตมีความระทมขมขื่นแอบแฝงอยู่ บุคคลเลข 47 มักจะใจอ่อน และเชื่อใจคนง่าย แต่ถ้าดื้อรั้นขึ้นมาก็ยากที่จะหยุดยั้ง ต้องระวังการหลงผิด จะทำลายอนาคตอันรุ่งเรืองเสียหาย แต่บุคคลเลข 47 เป็นคนขยันมั่นเพียรดี มักได้รับความสำเร็จจากความพยายามอันเหนื่อยยากกว่าจะพบเป้าหมาย ต้องใช้ความอดทนและพยายามมาก",
  48: "ไม่มีลาภ สิ่งยั่วยวน : เป็นคู่ของดาวพุธ (4) และดาวราหู (8) รวมกันได้ 12 เป็นกำลังราหูทางทักษา และเลข 12 บวกกันได้ 3 ดาวอังคารเป็นเลขร้าย บาปเคราะห์ จึงเป็นเลขค่อนข้างน่ากลัวควรระวังแต่อย่าเชื่อใจใครง่าย ท่านจะถูกชักจูง และหวาดล้อม จากพวกหลงผิดให้ไปเข้าพวกเข้าฝูง จะทำให้ตกอยู่ในอำนาจ แห่งความหลง กระทำแต่สิ่งไม่ดีและไม่ถูกต้องตลอด ควรระวังในชีวิตจะประสบอุบัติเหตุและเขี้ยวงา มักมีโรคภัยไข้เจ็บเบียดเบียน และได้ทุกข์ทรมานจากโรคร้าย",
  49: "ทุกข์ซ้ำซาก : เป็นคู่ของดาวพุธ (4) และดาวเกตุ (9) บวกกันได้ 13 แน่นอนเป็นเลขไม่ดี ทั้งไทยและฝรั่ง ถือเป็นเลขร้ายอับโชค มีอุปสรรค ถูกอำนาจมืดคุกคาม ในชีวิตมีมุมหักเหตลอดเวลา ไม่ค่อยจะปกติสุขรู้แค่นี้ก็ใจหายแล้ว",
  50: "ความกระตือรือร้น : เป็นคู่ของดาวพฤหัส (5) และดาวมฤตยู (0) เป็นเลขดี ดีมากด้วย (5) พฤหัสบดี เป็นตัวสติปัญญา เป็นคนมีคุณธรรม ส่วนดาวมฤตยูทำให้ชอบเดินทางไปต่างประเทศ และสิ่งศักดิ์สิทธิ์บ่งถึงโชคในต่างแดน หรือผจญชีวิตในแดนไกล บุคคลที่ได้เลขอิทธิพล 50 มักจะไปใช้ชีวิตในต่างประเทศ หรือได้ไปศึกษาและคบหากับคนต่างชาติต่างภาษา ชอบค้นคิด แสวงหาธรรมะ เป็นบุคคลที่เชื่อในความเร้นลับของธรรมชาติ และมีญาณสัมผัสกับสิ่งศักดิ์สิทธิ์ได้ ถือเป็นเลขดี",
  51: "ความสุขที่ได้มา : เป็นคู่ของดาวพฤหัส (5) และดาวอาทิตย์ (1) ได้กำลังจากดาวพฤหัส (5) ทำให้เป็นผู้มีวิชาความรู้ ใฝ่คุณธรรม เลข 51 เป็นกำลังของดาวจันทร์ มักทำให้เป็นคนมีเสน่ห์ มีปฏิภาณว่องไว เข้ากับคนได้ทุกระดับ อ่านใจคนเก่ง มักมีผู้ใหญ่คอยให้การอูปถัมภ์ค้ำจุนช่วยเหลือตลอด มักได้รับของตอบแทน ทั้งสิ่งของและการเงินจากบุคคลอื่น บุคคลเลข 51 เป็นนักพูดชั้นดี มีคารมดึงดูด เร้าใจผู้อื่น เหมาะกับอาชีพนักปกครอง นักบริหาร เลข 51 บวกกันได้เลข 6 คือ ดาวศุกร์ บ่งถึงความสำเร็จ มีมิตรสหายมาก มีรสนิยมทางศิลปะ รักสวยรักงาม ชอบความรื่นรมณ์ มีพรสวรรค์ มักจะมองโลกในแง่ดีเสมอ ไม่ชอบเก็บตัว ไม่ชอบความทุกข์ ใจกว้าง ถือเป็นเลขดี",
  52: "อุปสรรคที่ต้องเจอ : เป็นคู่ของดาวพฤหัส (5) และดาวจันทร์ (2) ดูเผินๆ เป็นเลขดี ทำให้ชีวิตได้รับความสำเร็จอย่างดี แต่เลข 52 บวกกันได้เลข 7 ดาวเสาร์ทำให้ชีวิตมีมุมหักเหได้ง่าย มักจะทำให้ความทุกข์ของกรรมเก่าที่มองไม่เห็นมีอุปสรรคใหญ่หลวงรออยู่ข้างหน้า ทำให้ต้องใช้ความพยายามและความอดทนมาก ถึงจะผ่านพ้นไปได้ ถ้าเลข 52 เป็นเลขบุรุษ จะได้รับความเกื้อหนุนจากสตรีอย่างดีเยี่ยม เรียกว่า ดาวนารีอุปถัมภ์",
  53: "การถูกเบียดบัง : เป็นคู่ของดาวพฤหัส (5) และดาวอังคาร (3) คนที่ได้เลขนี้ต้องมีใจคอหนักแน่น เป็นเลขกลางๆ มีทั้งดีและร้ายสลับกันไป เลข 5 จะนำความสำเร็จในชีวิตมาให้เป็นอย่างดี แต่ต้องระวังเลข 3 จะทำให้อนาคตเบื้องหน้ามีมุมหักเห เปลี่ยนรูปได้ จะมีบุคคลที่ชั่วร้ายบางคนมาเบนชีวิตให้เป็นไปในทางเสื่อม อย่าหูเบาเชื่อใครง่ายนัก และอย่าได้สมาคมกับบุคคลที่ไม่น่าไว้วางใจ ระวังมักจะตกอยู่ในอารมณ์ลุ่มหลงอะไรได้ง่าย เลข 53 บวกกันได้ เลข 8 คือ ดาวราหู",
  54: "ดวงดาวแห่งโชค : เป็นคู่ของดางพฤหัส (5) และดาวพุธ (4) เป็นดาวศุภเคราะห์ที่ให้คุณทั้งคู่ เป็นคู่ดาวนักปราชญ์ราชบัณฑิต รวมกันได้ดาวเกตุ (9) เรียกว่า มีองค์รักษา เป็นเลขที่แสดงถึงนิมิตแห่งความสำเร็จ ชีวิตมักจะได้รับการคุ้มครองจากสิ่งศักดิ์สิทธิ์ เป็นคนเรียนรู้ง่าย มีสติปัญญาแตกฉาน เข้าใจอะไรได้ง่าย อุปสรรคในชีวิตมีน้อย ถือเป็นเลขดี",
  55: "เจริญก้าวหน้าและสุขสบาย : เป็นเลขของดาวพฤหัส (5) เป็นเลขดี บ่งถึงความก้าวหน้าของชีวิตอย่างมั่นคง มีความเที่ยงธรรม และรักในคุณธรรมความดี ในใจมักเลื่อมใสในสิ่งศักดิ์สิทธิ์ ชอบเดินทางไกล วาระสุดท้ายบั้นปลายของชีวิต จะปลีกตัวออกจากวงสังคมเพื่อความสงบและถือสันโดษ",
  56: "มีโชคเรื่องความรัก : เป็นเลขของดาวพฤหัส (5) และดาวศุกร์ (6) ดาวพฤหัสดี คือ ดาวแห่งสติปัญญาและโชคลาภ ดาวศุกร์ เป็นเรื่องของความรักและความสุนทรี ดังนั้น เลข 56 เป็นเลขดี ชีวิตจะประสบความสำเร็จดี เป็นเลขคู่โชคคู่ทรัพย์ ทำอะไรก็สะดวกสบาย ได้รับการสนับสนุนจากผู้ใหญ่ช่วยเหลืออย่างดี มั่นคงในอนาคต ถ้าบุคคลหมายเลข 56 มีอิทธิพลของหมายเลข 23 เข้ามาพัวพัน ถ้าพูดถึงความรักก็เป็นนักรักตัวฉกาจ หาตัวจับยาก ชะตาชีวิตรุ่งเรืองมีบุญพาวาสนาส่ง คิดทำสิ่งใดก็ดูจะสำเร็จง่ายดาย อุปสรรคน้อย มีผู้สนับสนุนอยู่เบื้องหลัง ความรักก็สดใสสวยงาม มีความสมปรารถนาน่าชื่นใจ มีความหมายเหมือนกับเลข 65",
  57: "ความดื้อดึง : เป็นคู่ของดาวพฤหัส (5) และดาวเสาร์ (7) ด้วยอิทธิพลของ 7 ดาวเสาร์ เป็นคนมีความคิดขัดแย้งในตัวเอง และส่วนรวมค่อนข้างดื้อรั้น เอาแต่ใจตนเอง มักไม่เชื่อใจใคร ทำอะไรมักจะทำแบบครึ่งๆ กลางๆ มักเป็นคนกำพร้า และเรียนอะไรไม่สำเร็จครึ่งๆ กลางๆ แต่อิทธิพลของเลขประธานดาวศุภเคราะห์และดาวบาปเคราะห์ ทำให้ชีวิตจะดำเนินไปอย่างมั่นคง มีความปรารถนาอย่างแรงกล้า",
  58: "เส้นทางชีวิตที่ผิดพลาด : เป็นคู่ของดาวพฤหัส (5) และดาวราหู (8) หมายเลขนี้มีความหมายว่า คู่ธรรมคู่โลก ด้วยอิทธิพลของดาวราหู 8 เป็นเลขไม่ดี บ่งบอกถึงการชอบหลงผิด เห็นกงจักรเป็นดอกบัว เข้าลักษณะต้นตรงปลายคด จิตใจมักจะวิปริตเฉไฉออกนอกลู่นอกทางชอบคัดค้านด้านศาสนา จิตใจโน้มเอียงไปในด้านเดียรถีย์หรือมิฉะนั้นก็จะเป็นคนหลงศาสนาอย่างงมงาย จนไม่มีเหตุผลหลงผิดในพิธีกรรมต่างๆ มากกว่าแก่นแท้ของธรรมะ แต่ทั้งนี้ต้องพิจารณาจากดาวเคราะห์ที่สถิตในดวงชะตา ว่าสถิตในตำแหน่งให้คุณให้โทษประการใด ถ้าดาวราหูสถิตในตำแหน่งที่ให้คุณ จะหมายถึง ผู้มีจิตรานุภาพสูง เป็นผู้เชี่ยวชาญและช่ำชองเฉพาะทาง ดาวพฤหัส เลข 5 ถ้าสถิตในตำแหน่งที่เสีย หมายถึง ผู้มีคุณธรรมบกพร่อง อาจเข้าข่ายจิตเสื่อมหรือจิตทรามได้",
  59: "ยอดแห่งรหัสชีวิต : เลข 5 คือ ดาวพฤหัส เป็นดาวครู เลข 9 คือ ดาวเกตุ คราสสุริยเทพ อิทธิพลคล้ายคลึงกับเลข 14 ถือเป็นเลขมงคล เป็นคนยึดมั่นในสิ่งศักดิ์สิทธิ์ เชื่อถือในศาสนา และศรัทธาความเร้นลับของธรรมชาติ มักเป็นคนหัวเก่า รักความยุติธรรม เชื่อในวิญญาณ ชอบในเรื่องพิธีกรรมและโชคลางต่างๆ สนใจในศาสตร์เร้นลับ เป็นคนมีลางสังหรณ์ดีเยี่ยม เลข 59 เป็นเลขศักดิ์สิทธิ์ เปรียบเหมือนยันต์คุ้มครองตัวผู้อยู่ใต้อิทธิพลของเลขนี้",
  60: "มีโชคเรื่องการเงิน และความเพ้อฝัน : เลข 6 คือ ดาวศุกร์ เป็นดาวคหบดี เลข 0 คือ ดาวมฤตยู เป็นดาวนักวิทยาศาสตร์และเทคโนโลยี เมื่อรวมกันจะเป็นดาวคู่แห่งคหบดีนักวิทยาศาสตร์ ดาวศุกร์ (6) เป็นดาวศิลปะ สุนทรียะ ความรัก คนเลข 6 จึงมีเสน่ห์ รักสวยรักงาม มีรสนิยมดีชอบศิลปะ และดนตรี สนุกบันเทิง เป็นพวก ‘สุขนิยม’ ต้องการให้ผู้อื่นมีความสุขโดยไม่อิจฉาริษยา นอกจากนี้ยังรวมไปถึงโภคทรัพย์ ทรัพย์สินต่างๆ ส่วนอิทธิพลของเลข 0 ส่งผลให้เป็นคนมีสติปัญญาเฉียบแหลม ค่อนไปทางสติเฟื่อง มีอำนาจลึกลับและอิทธิพล เอาชนะอุปสรรคได้อย่างประหลาด มีเสน่ห์ดึงดูด มีหัวคิดริเริ่ม หยั่งรู้เข้าในในศาสตร์ลี้ลับ มีบุคลิกภาพที่เป็นพิเศษเฉพาะตัว",
  61: "ความพ่ายแพ้ : เป็นคู่ของดาวอาทิตย์ (1) กับดาวศุกร์ (6) รวมกันได้ 7  ดาวเสาร์ เป็นคนสองอารมณ์ มีความขัดแย้งในตัวเอง บางครั้งมักจะปล่อยตัวปล่อยใจให้หลงระเริงไปกับแสงสีและสิ่งยั่วยวนของโลกีย์ แต่บางขณะชอบทำตัวเหมือนคนอมทุกข์ หนีสังคมทำให้เป็นคนสันโดษ จึงทำให้ดูเหมือนเป็นคนมีสองลักษณะในตัวเอง ชีวิตมักจะมีมุมหักเหได้ง่ายชอบทำตัวหยิ่งจนคนไม่ชอบหน้า จนบางครั้งวงสังคมไม่ยอมรับ ระวังบั้นปลาย มักจะถูกเบียดเบียน ประสบแต่ความทุกข์ และอุปสรรค โรคภัยไข้เจ็บ",
  62: "อำนาจมืด : เป็นคู่ของดาวศุกร์ (6) และดาวจันทร์ (2) รวมกันได้ 8 พระราหู เป็นคนชอบปล่อยตัวปล่อยใจล่องลอยไปเรื่อยๆ หากลุ่มหลงสิ่งใดแล้ว มักไม่มีสติยับยั้ง มักมัวเมาในอารมณ์ หลงผิดได้ง่ายและท้ายที่สุด คือความหายนะ แต่ในอีกแง่มุมหนึ่งของเลข 62 เป็นเลขดีในด้านมีคนคอยช่วยเหลืออุปถัมภ์ มีมิตรสหายมากถ้าเป็นบุรุษมักจะเป็นที่โปรดปรานของเพศตรงข้าม ระวังโรค ตับอักเสบ ถุงน้ำดี เจ็บกล้ามเนื้อ เจ็บกระดูก",
  63: "มีเงิน ความรักและความสดชื่น : เป็นคู่ของดาวศุกร์ (6) และดาวอังคาร (3) เป็นเลขโรแมนติก เป็นดาวคู่มิตร ที่มีเสน่ห์ยิ่ง บ่งบอกถึงความรักอันสมหวังหวานชื่น บุคคลใต้อิทธิพลนี้ จึงเป็นคนมีเสน่ห์ดึงดูดใจเพศตรงข้าม มีมิตรสหายมาก เลข 63 บวกกันได้เลข 9 ในชีวิตจะได้รับความสำเร็จอย่างดี สุภาพสตรีที่ตกอยู่ภายใต้อิทธิพลของหมายเลข 63 จะมีโอกาสได้แต่งงานสูงมาก",
  64: "ชีวิตพบกับความสำเร็จ : เป็นคู่ของดาวศุกร์ (6) และดาวพุธ (4) เป็นดาวคู่ธาตุน้ำที่ให้คุณมาก และเป็นดาวศุภเคราะห์ทั้งคู่ ดาวศุกร์ หมายถึง ความรักและกามารมณ์ ดาวพุธ หมายถึง ความคิดความอ่าน และปฎิภาณไหวพริบ เมื่อรวมกันแล้ว เป็นคนมีความคิดอ่านดีในเรื่องความรักและกามารมณ์ เลข 64 เป็นคนมีรสนิยมสูง มีเสน่ห์ ไม่ชอบหยุดนิ่งอยู่กับที่ ชอบแสวงหาสิ่งใหม่ๆ อยู่เสมอ ชอบการเปลี่ยนแปลง หารสชาติใหม่ๆ ของชีวิต แต่ชอบคิดเพ้อฝัน มักใจอ่อน ทำให้ตกอยู่ใต้อิทธิพลผู้อื่นได้ง่าย เลข 64 จะทำให้ชีวิตพบความสำเร็จ มีความสุข มีความราบรื่นแห่งชีวิต มีความเป็นปึกแผ่น มั่นคงถาวร",
  65: "คู่ทรัพย์คู่โชค : เป็นคู่ของดาวศุกร์ (6) และดาวพฤหัสบดี (5) เป็นดาวศุภเคราะห์ทั้งคู่ ดาวศุกร์ หมายถึง ความรัก ดาวพฤหัส หมายถึง สติปัญญา ความรอบรู้ ผู้ใหญ่ บ่งบอกถึงความสำเร็จอย่างดีเยี่ยม ได้รับความสนับสนุนจากผู้หลักผู้ใหญ่เป็นอย่างดี หรือมีผู้ใหญ่ให้การช่วยเหลืออย่างลับๆ แต่ติดที่เป็นคนช่างฝันและหลงใหลในศิลป์ เลขนี้บางครั้งก็ดูเหมือนเป็นคนนิ่มนวล แต่บางครั้งก็แข็งกร้าว ในด้านความรัก บุคคลใต้อิทธิพล เลข 65 จะเป็นนักรักตัวฉกาจ เจ้าของชื่อมีดวงชะตาดี หนุนนำให้ชีวิตราบรื่นและมีความเจริญก้าวหน้า ด้านดีมีความสำเร็จอย่างดีเยี่ยม เป็นเลขคู่ทรัพย์คู่โชค ทำอะไรก็สะดวกสบาย ได้รับการสนับสนุนจากผู้ใหญ่ช่วยเหลืออย่างดี มั่นคงในอนาคต ถ้าบุคคลหมายเลข 65 มีอิทธิพลของหมายเลข 23 เข้ามาพัวพัน ถ้าพูดถึงความรักก็เป็นนักรักตัวฉกาจหาตัวจับยาก ชะตาชีวิตรุ่งเรือง มีบุญพาวาสนาส่ง คิดทำสิ่งใดก็ดูจะสำเร็จง่ายดาย อุปสรรคน้อย มีผู้สนับสนุนอยู่เบื้องหลัง ความรักก็สดใสสวยงาม มีความสมปรารถนาน่าชื่นใจ",
  66: "แสงสีเสียง : เป็นคู่ของดาวศุกร์ (6) รวมกันได้ 12 ซึ่งเป็นกำลังดาวทางทักษาของพระราหู เลข 66 เป็นคนที่รักอะไรก็รักอย่างลุ่มหลง เป็นคนที่หลงมัวเมาได้ง่าย เพราะไม่ค่อยพิจารณาไตร่ตรองอะไรให้รอบคอบ รักอะไรก็มักจะทุ่มเทลงไปทั้งตัว เป็นคนมัวเมาแต่โลกีย์ ถือเป็นเลขอันตราย ต้องระมัดระวังให้มาก เพราะใต้อิทธิพลของเลขนี้จะทำให้พัวพันกับสิ่งยั่วเย้าอารมณ์ทั้งปวง ระวังธุรกิจจะล้มลงอย่างฉับพลัน เช่น ธุรกิจ การค้า หน้าที่การงาน ความรัก ก็จะมีอุปสรรคมาขวางกั้น มีความทุกข์แอบแฝงอยู่ ชีวิตสมรสไม่แน่นอน",
  67: "บ้านแตกสาแหรกขาด : เป็นคู่ของดาวศุกร์ (6) และดาวเสาร์ (7) เป็นเลขแห่งความผิดหวัง ทุกข์เศร้า เพราะ ดาวเสาร์ (7) รวมกันได้ 13 เป็นเลขไม่ดีอีก มองดูเป็นเลขครึ่งๆ กลางๆ จะดีก็ไม่ใช่ จะร้ายก็ไม่เชิง เพราะมีทั้งดาวโภคทรัพย์ และดาวแห่งทุกข์และอุปสรรคมารวมกัน แต่ชีวิตมักพบอุปสรรคมากมาย จะผิดหวังในความรัก ครอบครัวจะแตกร้าว บ้านแตกสาแหรกขาด เป็นเลขที่แสดงออกถึงความขัดแย้งกันเอง อย่างรุนแรง จะตกต่ำในบั้นปลายของชีวิต ระวังอุบัติเหตุด้วย และยังมีโรคภัยไข้เจ็บเข้ามาเบียดเบียน จะต้องได้รับการผ่าตัดบริเวณช่องท้อง คือโรคลำไส้อักเสบ กระเพาะปัสสาวะอักเสบ ถุงน้ำดี โรคนิ่ว และโรคไต สายตา",
  68: "ผู้ประพฤติผิดศีลธรรม : เป็นคู่ของดาวศุกร์ (6) และดาวราหู (8) เป็นเลขมัวเมาอีกเลขหนึ่ง โดยเฉพาะจะมัวเมาในอุดมคติ หลงใหลปลื้มกับอบายมุข เป็นเลขที่แสดงถึงหลักการมีศรัทธาจริตอันลุ่มหลง บ้าคลั่งในศาสนา หลงตัวเอง หลงในสังคม มักชอบทำตัวให้เด่น ชอบความตื่นเต้น คิดและตัดสินใจเร็ว เก่งในการแก้ปัญหาเฉพาะหน้า มักเป็นจู้จี้ ขี้บ่น เบื่อกับการอยู่กับที่นาน",
  69: "ความหวั่นไหวลังเล : เป็นคู่ของดาวศุกร์ (6) และดาวเกตุ (9) เป็นเลขที่แสดงถึงความใจอ่อน ชอบเพ้อฝัน หลงละเมอเพ้อพกแต่ความฝัน ทำให้ตกอยู่ใต้อิทธิพลของคนอื่นได้ง่าย แต่ยังดีที่มีผู้ใหญ่ให้ความอุปถัมภ์ค้ำชูดีอยู่ เป็นทั้งเลขดีและร้าย ให้คุณทางด้านความมีเสน่ห์ และอาจจะประสบความสำเร็จได้เหมือนกัน ดาวศุกร์และดาวเกตุหนุนนำให้ไม่เหนื่อยยากลำบากอะไรมากนัก สติปัญญาดี เรียนเก่ง เรียนรู้เร็ว เพื่อนฝูงรักใคร่ เพราะเป็นคนมีน้ำใจดี แต่มีความโดดเดี่ยวเปลี่ยวเหงาในใจ เป็นเลขกลับหัวกลับหาง ไม่สามารถแยกแยะได้ จึงทำให้ไม่มีพลังในตัวเอง หวั่นไหวลังเลไม่เป็นตัวของตัวเอง จะทำให้พลาดโอกาสดีๆ อย่างน่าเสียดาย ชีวิตกระท่อนกระแท่นครึ่งๆ กลางๆ จะดูว่าดีก็ไม่ใช่ จะดูร้ายก็ไม่เชิง บางครั้งก็ส่งผลให้หลงผิดได้ง่าย ร้ายก็ยังดีที่มีผู้ใหญ่ที่เข้าใจ คอยให้การอุปถัมภ์ค้ำชูพอที่จะทำให้ชีวิตอยู่รอดไปได้",
  70: "ความเหี้ยมโหด : เป็นคู่ของดาวเสาร์ (7) และดาวมฤตยู (0) เป็นเลขแห่งความทุกข์โศกอย่างแท้จริง บ่งบอกถึงความอำมหิต โรคประสาท อำนาจเร้นลับ อำนาจมืด โรคภัยร้ายแรง การอัตวินิบาตกรรม การถูกคุมขัง ถูกปล้น และภัยธรรมชาติอย่างร้ายแรง มักถูกปล่อยเกาะไว้อย่างโดดเดี่ยว เป็นเลขที่อันตรายมาก จะต้องต่อสู้กับอุปสรรคและปัญหาอย่างมากมาย ความกดดันในชีวิตมีสูงหากระงับอารมณ์ไม่ได้ เพียงชั่ววูบหนึ่งของชีวิตอาจตัดสินใจทำอะไรลงไปด้วยความเหี้ยมโหด ชนิดที่คนอื่นคาดคิดไม่ถึง อาจจะไม่เคยคิดที่จะทำร้ายใครหรือทำร้ายตนเองอยู่ในสมอง แต่เมื่อไรที่คิดและกระทำมักจะทำสำเร็จ ควรที่จะหนีให้ไกลๆ จากหมายเลขนี้",
  71: "ถูกจำกัดอำนาจ : เป็นคู่ของดาวเสาร์ (7) และดาวอาทิตย์ (1) เป็นเลขแห่งความหลงผิด บ่งถึงการถูกจำกัดอำนาจการตกจากตำแหน่ง การถูกใส่ร้ายป้ายสี การคุมขัง เป็นเลขแสดงถึงวิบัติ การหลงมัวเมาไปในทางที่ผิดๆ อาจตกจากตำแหน่งหน้าที่การงาน การถูกใส่ร้ายป้ายสี การถูกคุมขัง หน้าที่การงานจะไม่ยั่งยืนถาวร หลงมัวเมาในทางที่ผิดๆ หลงมัวเมาไปในทางที่ผิดๆ ต้องตกอยู่ในสิ่งแวดล้อมที่ไม่ดี ถูกคนเอารัดเอาเปรียบถูกเบียดบังเอาความดีความชอบ จะมีปัญหารักสามเส้า ชีวิตจะอาภัพผิดหวังในเรื่องของความรัก หย่าร้างกัน แต่งงานช้า ไม่ได้แต่งงาน ได้แต่งก็เลิกกัน ได้พ่อหม้าย เป็นเมียน้อย",
  72: "ความวุ่นวาย : เป็นคู่ของดาวเสาร์ (7) และดาวจันทร์ (2) ถึงแม้จะส่งผลให้ชีวิตรุ่งเรือง ดวงชะตาเข็มแข็งเจริญรุ่งเรืองดี แต่มีแต่ความวุ่นวาย บุรุษมักจะได้รับความทุกข์จากเพศตรงข้าม มักจะเคราะห์ร้ายอยู่บ่อยๆ ระวังจะมีโรคภัยไข้เจ็บอย่างเรื้อรัง ชีวิตวุ่นวายพอสมควร มักจะมีความคิดเห็นเป็นของตนเอง ชีวิตมักจะพบกับความกดดันอย่างรุนแรง มีความทุกข์ผิดหวังเข้ามาแอบแฝง จะต้องมีการสูญเสีย บุคคลที่รักในขณะที่ชีวิตประสบความสำเร็จ เช่น เสียบิดา คู่ครอง หรือญาติมิตรที่เคารพรักต้องจากไป หรือไม่ก็เสียเงินที่หามาได้อย่างไม่คาดคิดเรียกว่า ทุกข์ลาภ จะมีชีวิตที่วุ่นวาย เพศตรงข้ามสร้างปัญหามาให้ตลอดเวลา บั้นปลายชีวิตจะต้องทุกข์ทรมานกับโรคภัยไข้เจ็บ ระวังการผ่าตัด ระวังโรคผิวหนัง",
  73: "ถูกจำกัดอำนาจ : ดาวบาป เคราะห์ที่ร้ายแรง ทั้งดาว 7 (เสาร์) และดาว 3 (อังคาร) เป็นเลขร้าย บ่งบอกถึงการแตกหักทำลายชีวิตมักจะหักเหกลางคัน เป็นอุบัติเหตุ การผ่าตัด การล้มละลาย บุคลที่อยู่ภายใต้อิทธิพลเลขนี้อย่าได้จริงจังต่อชีวิตมากนัก เพราะเป็นเลขโทษ ชีวิตมักจะเริ่มต้นร่ำไป และยังหมายถึงการทะเลาะวิวาทขัดแย้ง วิบัติทุกข์ทรมานจากโรคร้าย ระวังการผ่าตัดอุบัติเหตุ ความเสียหายที่จะเกิดขึ้นอย่างรุนแรง ชีวิตสมรสไม่แน่นอน ชีวิตต้องเริ่มใหม่อยู่เสมอมักเกี่ยวข้องกับความตาย ชีวิตมีความข่มขืนผิดหวัง อมทุกข์ บริวารนำเรื่องเดือดร้อนมาให้ มีหนี้สินอย่างท่วมท้น ระวังโรคหัวใจ ความดันโลหิต อัมพาต อัมพฤกษ์",
  74: "ชีวิตที่ต้องเหนื่อยเปล่า : เป็นคู่ของดาวเสาร์ (7) และดาวพุธ (4) เป็นดาวคู่สมพลที่ดี จึงเป็นเลขที่ดีพอสมควร เต็มไปด้วยความกลมกลืนเป็นอย่างดี จึงส่งผลให้ชีวิตพบกับความสำเร็จดีพอสมควร แต่ความก้าวหน้าของชีวิตจะไปไม่ถึงจุดสูงสุด เป็นคนรวนเร หูเบา เชื่อคนง่าย และคิดจะเพ้อฝันอยู่ด้วย เป็นคนที่มักจะวิตกกังวลทุกข์ใจอยู่เสมอ",
  75: "ชีวิตที่ผลิกผัน : เป็นคู่ของดาวเสาร์ (7) และดาวพฤหัส (5) เรียกว่า คู่พระคู่โจร ดาวบาปเคราะห์ อยู่ร่วมกับดาวศุภเคราะห์ ชีวิตในการเริ่มต้นมักจะไม่ประสบผลสำเร็จ มีแต่เรื่องยุ่งๆ มีแต่เรื่องวุ่นวายโกลาหลต่างๆ มากมาย มักจะกำพร้าผู้ใหญ่ มักถูกตำหนิ ผู้ใหญ่ให้โทษ แต่ในบั้นปลายของชีวิตจะรุ่งโรจน์มาก เรียกว่า ชีวิตแบบต้นร้ายปลายดี ระวังอาจตกจากตำแหน่งหน้าที่การงาน การถูกใส่ร้ายป้ายสี การถูกคุมขัง หน้าที่การงานจะไม่ยั่งยืนถาวร จะประสพความลำบากในชีวิตก่อน แล้วจึงจะได้ดีทีหลัง หลงมัวเมาในทางที่ผิดๆ หลงมัวเมาไปในทางที่ผิดๆ ต้องตกอยู่ในสิ่งแวดล้อมที่ไม่ดี ถูกคนเอารัดเอาเปรียบถูกเบียดบังเอาความดีความชอบ จะมีปัญหารักสามเส้า ชีวิตจะอาภัพผิดหวังในเรื่องของความรัก หย่าร้างกัน แต่งงานช้า ไม่ได้แต่งงาน ได้แต่งก็เลิกกัน ได้พ่อหม้าย เป็นเมียน้อย",
  76: "ครอบครัวแตกแยก : เป็นคู่ของดาวเสาร์ (7) และดาวศุกร์ (6) รวมกันได้ 13 เป็นเลขน่ากลัวมาก ผู้อยู่ใต้อิทธิพลเลขนี้ ชีวิตมักจะอับเฉา บ้านแตกสาแหรกขาด ไม่มีความสุข โดยเฉพาะชีวิตคู่มักจะร้างคู่หรือตกพุ่มหม้าย เป็นเลขที่มีอุปสรรคในชีวิตมากมาย ผิดหวังเรื่องความรัก ครอบครัวแตกร้าว ไม่มีความสุขในชีวิตสมรส บ้านแตกสาแหรกขาด เป็นเลขที่ขัดแย้งกันอย่างรุนแรง หมายถึง ความตกต่ำในบั้นปลายชีวิต และยังมีโรคภัยไข้เจ็บเข้ามาเบียดเบียน จะต้องได้รับการผ่าตัดบริเวณช่องท้อง คือ โรคลำไส้อักเสบ กระเพาะปัสสาวะอักเสบ ถุงน้ำดี โรคนิ่ว และโรคไต สายตา",
  77: "ทุกข์ซ้อนทุกข์ : ดาวเสาร์ (7) ซ้อนกันสองดวง ดาวทุกข์ 2 ดวง ทำให้มีทุกข์เป็น 2 เท่า ความเก็บกด อำนาจเร้นลับ อำนาจมืด โรคภัยที่ร้ายแรง การอัตวิบากกรรม การถูกคุมขัง ถูกปล้น เป็นเลขที่อันตรายมาก จะต้องต่อสู้กับอุปสรรคและปัญหาอย่างมากมาย ความกดดันในชีวิตมีสูงหากระงับอารมณ์ไม่ได้ เพียงชั่ววูบหนึ่งของชีวิตอาจตัดสินใจทำอะไรลงไปด้วยความเหี้ยมโหด ชนิดที่คนอื่นคาดคิดไม่ถึง อาจจะไม่เคยคิดที่จะทำร้ายใครหรือทำร้ายตนเองอยู่ในสมอง แต่เมื่อไรที่คิดและกระทำมักจะทำสำเร็จ ควรที่จะหนีให้ไกลๆ",
  78: "นักเลง นักบู๊ ระวังต้องคดี : เป็นคู่ของดาวเสาร์ (7) และดาวราหู (8) เรียกว่า ดาวคู่มิตรแบบมาเฟียหรือมิตรชั่ว เป็นเลขที่บ่งถึงความระส่ำระสาย วุ่นวาย โกลาหลของชีวิต ประสบแต่สิ่งร้ายๆ เป็นคนที่อ่อนแอ มักปล่อยให้คนอื่นชักจูงได้ง่าย ชีวิตต้องระวังอุบัติเหตุและคดีความไว้มากๆ อย่าใจอ่อนเชื่อใครง่าย จะประสบกับความหายนะ และยังหมายถึงความระส่ำระสายของชีวิต ประสบเรื่องร้ายๆ ทำให้เป็นคนอ่อนแอ เชื่อคนง่าย ห้ามเซ็นต์สัญญาค้ำประกันใคร ชีวิตต้องต่อสู้เหน็ดเหนื่อยกับอุปสรรคและปัญหา ตกอยู่ในสภาพแวดล้อมไม่ดี ส่วนใหญ่จะเป็นรหัสของผลรวมของชื่อและนามสกุล",
  79: "เหน็ดเหนื่อย วิบากกรรม : เป็นคู่ของดาวเสาร์ (7) และดาวเกตุ (9) เลขให้คุณปานกลาง ส่วนดี คือ พระเกตุและดาวเสาร์หนุนนำให้มีความสำเร็จ คนเลขนี้ชอบท่องเที่ยวเดินทาง เป็นคนจริงใจ เป็นคนรักอิสระ และมีความคิดเป็นของตัวเอง ใจบุญ มีอุดมการณ์สูง ผูกพันเกี่ยวข้องกับน้ำ ถ้าทำธุรกิจเกี่ยวกับน้ำจะดี พูดตรงไปตรงมา เจ้าระเบียบ ชะตาชีวิตสดใสงดงาม จะมีความรุ่งโรจน์โชติช่วงอย่างคาดไม่ถึง ดวงมีทรัพย์มรดก จะมีเกียรติมีลาภยศ แต่ส่วนเสีย คือ ต้องต่อสู้กับปัญหา กว่าจะผ่านพ้นไปได้ต้องเหน็ดเหนื่อย ต้องใช้ความอดทนแต่จะประสบความสำเร็จได้เช่นกัน ส่วนใหญ่จะเป็นรหัสของผลรวมของชื่อและนามสกุล",
  80: "อิทธิพลมืด : เป็นคู่ของดาวราหู (8) และดาวมฤตยู (0) เป็นเลขร้าย เป็นสัญญาณเตือนภัยวิบัติอันใหญ่หลวงที่คอยอยู่ข้างหน้า มักถูกครอบงำจากอิทธิพลของอันธพาล ถูกข่มเหง รังแกจากคนอันธพาล จะตกอยู่ในสิ่งแวดล้อมที่ไม่ดี ถูกปล้น ถูกจี้ ระวังจะถูกฆ่าข่มขืน มีวิญญาณร้ายคอยแอบแฝงรบกวน ชอบสะสมของเก่า หรือมีความผูกพันกับโบราณสถาน ระวังโรคตับ ถุงน้ำดี ไมเกรน เจ็บปวดตามกระดูกตามข้อ",
  81: "บททดสอบแห่งความทุกข์ : เป็นคู่ของดาวราหู (8) และดาวอาทิตย์ (1) เรียกว่าคู่ผูกพัน หรือคู่ตรงข้าม เป็นเลขที่บ่งบอกถึงชีวิต ที่มักกำพร้าขาดหลักประกันของชีวิต พลัดพรากจากบิดา ชีวิตมักมีการโยกย้ายบ่อยๆ ถ้าเป็นหญิงจะตกพุ่มหม้ายไร้สามีหรือพลัดพรากจากกัน จะเป็นโรคเกี่ยวกับตา แต่บางครั้งการเปลี่ยนแปลงบ่อย ๆ ก็ทำให้ชีวิตเปลี่ยนเป็นรุ่งเรืองดี",
  82: "โดดเดี่ยว ว้าเหว่ : เป็นคู่ของดาวราหู (8) และดาวจันทร์ (2) เรียกว่า คู่สมพล มีความหมายเป็นกลางๆ ว่า อำนาจ อิทธิพล ความสามารถ ความรู้ ความชำนาญ ตำแหน่งหน้าที่ ‘ในดวงหญิง’ เรียกว่า จันทร์มัวหมอง เป็นฝ่ายเสียเปรียบ มักถูกล่วงละเมิดสิทธิทางเพศเป็นนิจสิน ชอบการมีกิจกรรมทางเพศ มักถูกวิพากษ์วิจารณ์ในทางเสียๆ หายๆ ‘ในดวงชาย’ เรียกว่า ราหูมัวเมา ได้กำไรชีวิต มักเป็นฝ่ายละเมิดสิทธิของเพศตรงข้าม เรียกว่า มักได้เจาะไข่แดง",
  83: "ความแตกแยก : เป็นคู่ของดาวราหู (8) และดาวอังคาร (3) คู่ดาวบาปเคราะห์ที่รุนแรง น่ากลัว เป็นเลขร้าย บ่งบอกถึงการทะเลาะวิวาท มักมีเหตุแตกหักเสียหายอยู่เสมอระวังอัคคีภัย และภัยจากฝูงชน จากสิ่งสาธารณะ และอุบัติเหตุร้ายแรง เกี่ยวกับการผ่าตัด มักถูกคุกคามจากนักเลงอันธพาล มักจะโอนอ่อนเชื่อใจคนง่าย จึงมักจะประพฤติอะไรผิดอยู่เสมอ",
  84: "หลงผิด มัวเมา : เป็นคู่ของดาวราหู (8) และดาวพุธ (4) เป็นเลขร้าย ชีวิตในวัยรุ่นมักจะประพฤติผิดพลาด และได้รับอันตราย ชีวิตในวัยนี้มักจะได้รับความเดือนร้อนและสูญเสียอย่างใหญ่หลวง มักจะประสบชะตากรรมอย่างรุนแรง บาดเจ็บ อุบัติเหตุจากการกลั่นแกล้งจากบุคคลอื่น ระวังถูกคดีความ ผู้คนเกลียดชัง",
  85: "การหลักลอย : เป็นคู่ของดาวราหู (8) และดาวพฤหัส (5) รวมกันได้ 13 ผู้ที่อยู่ภายใต้อิทธิพลเลขนี้ ชีวิตมักจะหลักลอย เพราะมีอุดมคติที่ผิดๆ เป็นคนชอบหลงผิดได้ง่าย ลืมตัง เอาแต่ใจตนเอง มักเห็นกงจักรเป็นดอกบัว จะพาชีวิตไปสู่หายนะ มักจะกำพร้าและขาดที่พึ่ง หากเป็นพระก็จะเป็นพระทุศีลเพราะอิทธิพลของพระราหู 8 ด้วย",
  86: "ผู้ประพฤติผิดศีลธรรม : เป็นคู่ของดาวราหู (8) และดาวศุกร์ (6) เป็นเลขแรง เป็นเลขที่ทางโลกจะประสบผลสำเร็จ แต่พ่ายแพ้ทางโลกีย์ ชีวิตจะลุ่มหลงมัวเมา แต่เรื่องกิเลส อบายมุข เอาแต่ใจตนเองชอบคบชู้ และเสพอบายมุขทั้งปวง บุคคลใต้อิทธิพลนี้ต้องระวังให้มากๆ ชีวิตจะประสบกับหายนะได้",
  87: "ทะเลเพลิงแห่งความทุกข์ : เป็นคู่ของดาวราหู (8) และดาวเสาร์ (7) บาปเคราะห์ทั้งเสาร์และราหู เป็นเลขที่มีเสน่ห์ แต่อ่อนไหวง่าย เจ้าอารมณ์ อมทุกข์ มักหลงผิด หูเบาเชื่อใจคนง่าย ชีวิตบั้นปลายมักจะตกต่ำ",
  88: "เห็นผิดเป็นชอบ : ราหู (8) คู่ น่ากลัวมาก บุคคลในเลขนี้ ชีวิตจะรุดหน้าไปได้ย่างรวดเร็ว พบกับความสำเร็จอย่างโรจน์โผน แต่ก็ทำให้ลุ่มหลง เอาแต่ใจตนเองเป็นที่ตั้งไม่เห็นใจใครมักจะเห็นผิดเป็นชอบได้ง่าย ไม่ยอมฟังคำเตือนของผู้ใดชีวิตต้องระวังอุบัติเหตุ จะมรณกรรมอย่างผิดปกติ",
  89: "ดาบสองคม : เป็นคู่ของดาวราหู (8) และดาวเกตุ (9) เป็นคู่ของคราสจันทร์และคราสอาทิตย์ เป็นคนหัวไว มีความคิดเฉลียวฉลาด จดจำสิ่งใดได้ง่ายเข้าสังคมได้ทุกระดับ เป็นที่ชอบพอวงสังคม แต่ค่อนข้างขีดเส้นชีวิตของตนเองไว้มากเกินไป จนบางครั้งทำให้เข้ากับคนอื่นไม่ค่อยได้ มักจะเลื่อมใสในศาสตร์เร้นลับ และค่อนข้างจะลุ่มหลงเอาง่ายๆ ด้วยอิทธิพลพระราหู 8",
  90: "สิ่งศักดิ์สิทธิ์คุ้มครอง : เป็นคู่ของดาวเกตุ (9) และดาวมฤตยู (0) ทางศาสตร์เครื่องรางของขลัง เรียกว่า เป็นคนมี ‘องค์รักษา’ เป็นเลขที่บ่งบอกถึงความศักดิ์สิทธิ์ ชีวิตมักจะพัวพันกับสิ่งศักดิ์และ วิญญาณตลอดเวลา มักจะได้รับความคุ้มครองจากวิญญาณ ในชีวิตจะประสบความสำเร็จพอสมควร",
  91: "ผู้เสวยสุข : เป็นคู่ของดาวเกตุ (9) และดาวอาทิตย์ (1) เป็นเลขแห่งความเชื่อมั่นในตัวเองสูง กล้าหาญ มีความทะเยอทะยานที่จะเป็นใหญ่เป็นโต สามารถไต่เต้าจากระดับฐานะหนึ่งสูงขึ้นไปจนถึงจุดสูงสุดที่ตนเองหวังได้ มีคนเชื่อถือและไว้วางใจ ใฝ่หาความก้าวหน้าในชีวิต เป็นคนชอบแสวงหาความแปลกใหม่อยู่เสมอ มีความคิดริ่เริ่มสิ่งใหม่ๆ เห็นอกเห็นใจคนอื่น สนใจในสิ่งหนึ่งสิ่งใดอย่างจริงจัง มักทำสิ่งต่างๆที่แปลกแหวกแนวไม่เหมือนใคร สนใจทางการค้นคว้า และเลื่อมใสในศาสตร์เร้นลับ มีสิ่งศักดิ์สิทธ์คุ้มครอง เป็นคนชอบเก็บตัว มักปลีกตัวเองไปอยู่สันโดษ",
  92: "ราชสีห์สิ้นเขี้ยวเล็บ : เป็นคู่ของดาวเกตุ (9) และดาวจันทร์ (2) ดาวเกตุ คือ คราสสุริยเทพ ดาวจันทร์ จะทำอะไรมักจะดีแต่ตอนเริ่มต้นแต่ปลายเสีย ยิ่งใหญ่ก็อาจตกต่ำได้ ชีวิตจะอยู่ในสภาพแวดล้อมที่ไม่ดี ถูกกลั้นแกล้ง เอารัดเอาเปรียบ เพศตรงข้ามจะสร้างปัญหาให้ หน้าชื่นอกตรม ระวังเพื่อนที่ไม่ซื่อ ไม่ควรร่วมหุ้นกับใคร ชอบเดินทางท่องเที่ยว ชอบสิ่งแปลกใหม่ สนใจประวัติศาสตร์ ชอบของโบราณ",
  93: "ชีวิตที่ถูกกดดัน : เป็นคู่ของดาวเกตุ (9) และดาวอังคาร (3) บอกแล้วว่า ดาวอังคาร (3) อยู่ไหน แรงที่นั่น เป็นเลขเข้มแข็ง บ่งบอกถึงความแข็งกร้าว แตกหัก ชีวิตมักจะประสบผลสำเร็จอยู่เสมอ ทำอะไรมักจะเอาแต่ใจตนเอง มักเป็นโรคแปลกๆ ระวังการผ่าตัด เป็นคนมุทะลุ ชอบทะลุกลางปล้อง ลุ่มหลงมัวเมาตัวเอง",
  94: "อุปสรรคที่ขวางกั้น : เป็นคู่ของดาวเกตุ (9) และดาวพุธ (4) รวมกันได้ 13 เป็นสัญลักษณ์ของความเสื่อม ความอับโชค ความขัดข้องทั้งปวง แม้ชีวิตก้าวหน้าไปด้วยดี แต่มักจะมีอุปสรรคตามมาเป็นเงาตามตัว ชีวิตมักจะมีมุมหักเหอยู่เสมอ สนใจทั้งจิตศาสตร์และศาสตร์เร้นลับ",
  95: "ยอดรหัสแห่งชีวิต : เป็นคู่ของดาวเกตุ (9) และดาวพฤหัส (5) เป็นเลขดี บ่งบอกถึงพลังแห่งความสำเร็จ มีบารมี มีสิ่งศักดิ์สิทธิ์คุ้มครองเสมอ เปรียบเสมือนเป็นยันต์คุ้มครอง ชีวิตจะประสบความสำเร็จอย่างดียิ่ง เข้ากับผู้หลักผู้ใหญ่ได้ดี จะได้รับการเคารพยกย่องจากปวงชน มีญาณพิเศษในตัวเอง สามารถเข้าใจสิ่งต่างๆล่วงหน้าได้อย่างประหลาด สนใจทางศาสตร์และวิญญาณ ชอบศึกษาขนบธรรมเนียมประเพณีโบราณ เป็นคนรักความยุติธรรม ชีวิตจะประสบความสำเร็จอย่างมั่นคงและดีเยี่ยม มีสมองเฉียบแหลมว่องไว เป็นคนชอบคิดค้น และจดจำสิ่งต่างๆ ได้อย่างแม่นยำ ปฏิภาณไหวพริบดีแก้ไขปัญหาเฉพาะหน้าเก่ง",
  96: "เหมือนคนไม่มีพลัง : เป็นคู่ของดาวเกตุ (9) และดาวศุกร์ (6) เป็นเลขที่ไม่มีพลังในตัวเอง ชีวิตสุกๆ ดิบๆ ครึ่งๆ กลางๆ บ่งบอกถึงความขัดแย้ง เข้ากันไม่ได้เป็นคนใจอ่อน มักถูกชักจูงให้หลงผิดได้ง่าย เป็นคนลักษณะถ้าคบคนดีก็ดีไป แต่ถ้าคบคนชั่วก็จะชั่วตามไปด้วย พวกมากลากไป",
  97: "ต้นร้ายปลายดี : เป็นคู่ของดาวเกตุ (9) และดาวเสาร์ (7) เป็นเลขแห่งความสำเร็จอีกเลขหนึ่ง ชีวิตจะก้าวหน้ารุ่งโรจน์ดี มีสมัครพรรคพวกเพื่อนฝูงมาก มักเข้มแข็งในหน้าที่การงาน มีสมรรถภาพดีเยี่ยม เป็นหัวหน้าที่ลูกน้องยำเกรง แต่ในชีวิตต้องระวังอุบัติเหตุ อาจถูกทำร้ายจากกรรมเก่า ต้องหมั่นทำบุญ",
  98: "ชีวิตที่ถูกครอบงำ : เป็นคู่ของดาวเกตุ (9) และดาวราหู (8) เป็นเลขที่ให้คุณอีกเลขหนึ่ง ดาวเกตุ หมายถึง คราสสุริยเทพ ดาวราหู คือ เทพเจ้าแห่งความมัวเมา ให้คุณในทางโลดโผน จะประสบผลสำเร็จดี มีพวกพ้องมาก ชอบทำอะไรแปลกๆ แหวกแนวเข้ากับใครได้ง่าย มักจะสนใจในสิ่งศักดิ์สิทธิ์จนลุ่มหลง ทำให้หลงผิดกลายเป็นหลอกลวงผู้อื่นไป ต้องระวังอย่าคบคนพาล ถ้าหากพัวพันจะถอนตัวจากสิ่งเลวร้ายได้ยาก",
  99: "ผู้พลิกแผ่นดิน : เป็นคู่ของดาวเกตุ (9) เลข 99 หรือ 9 คู่ มีพลังเร้นลับอยู่ด้วย คนเลขนี้สามารถสัมผัสกับสิ่งที่มนุษย์ทั่วไปไม่สามารถรู้ได้ มีลางสังหรณ์หรือญาณพิเศษดีเยี่ยม ใบ้หวยแม่น ฝันแม่น สนใจในศาสนา ปรัชญา เรื่องลึกลับทั่วไป อำนาจจิตเข้มแข็ง ถือเป็นเลขดี มีความเจริญก้าวหน้า มีสิ่งศักดิ์สิทธิ์คุ้มครอง",
};

class MainApp extends StatelessWidget {
  final String title = "Hora App";

  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: title,
      debugShowCheckedModeBanner: false,
      home: MainPage(
        title: title,
      ),
    );
  }
}

class MainPage extends StatefulWidget {
  final String title;

  const MainPage({this.title});

  @override
  _MainPageState createState() => _MainPageState();
}

class _MainPageState extends State<MainPage> {
  final formKey = GlobalKey<FormState>();
  final ctrName = TextEditingController();

  bool showDisplayPrediction = false;

  String nameTopredict = "";
  int scienceNumber = 0;

  @override
  Widget build(BuildContext context) {
    return Scaffold(
      appBar: AppBar(
        leading: Padding(
          padding: const EdgeInsets.all(8.0),
          child: Image.asset("assets/hora.png"),
        ),
        title: Text(
          widget.title,
          style: TextStyle(color: Colors.white),
        ),
        backgroundColor: Colors.cyan,
      ),
      body: SingleChildScrollView(
        scrollDirection: Axis.vertical,
        child: Column(
          mainAxisAlignment: MainAxisAlignment.center,
          children: [
            _inputFormSection(),
            _displayPredictionSection(),
          ],
        ),
      ),
    );
  }

  Widget _inputFormSection() {
    return Form(
      key: formKey,
      child: Padding(
        padding: EdgeInsets.only(
          left: 10.0,
          top: 15.0,
          right: 10.0,
          bottom: 5.0,
        ),
        child: Column(
          children: [
            TextFormField(
              controller: ctrName,
              decoration: InputDecoration(
                labelText: "ชื่อ (Name)",
                labelStyle: TextStyle(
                  color: Colors.black,
                  fontSize: 20.0,
                ),
                hintText: "กรุณากรอกชื่อ",
                helperText: "* ข้อมูลที่ต้องป้อน",
                helperStyle: Theme.of(context).textTheme.caption.copyWith(
                      color: Colors.black,
                    ),
                suffixIcon: Icon(
                  Icons.person,
                  color: Colors.blue,
                ),
                border: OutlineInputBorder(
                  borderRadius: BorderRadius.circular(
                    16.0,
                  ),
                ),
              ),
              maxLength: 30,
              validator: (value) =>
                  (value.length == 0) ? "กรุณาป้อนชื่อ" : null,
            ),
            Container(
              child: Center(
                child: Row(
                  mainAxisAlignment: MainAxisAlignment.end,
                  children: [
                    RaisedButton(
                      child: Text(
                        "คำนวณ/ทำนาย",
                        style: TextStyle(
                          color: Colors.white,
                        ),
                      ),
                      color: Colors.blueAccent,
                      elevation: 8,
                      shape: RoundedRectangleBorder(
                        borderRadius: BorderRadius.all(
                          Radius.circular(20.0),
                        ),
                      ),
                      onPressed: () {
                        if (formKey.currentState.validate()) {
                          setState(() {
                            showDisplayPrediction = true;
                            nameTopredict = ctrName.text;
                            _astrologyCalculation();
                          });
                        }
                      },
                    ),
                    SizedBox(
                      width: 20,
                    ),
                    RaisedButton(
                      child: Text(
                        "ล้าง",
                        style: TextStyle(
                          color: Colors.white,
                        ),
                      ),
                      color: Colors.blueAccent,
                      elevation: 8,
                      shape: RoundedRectangleBorder(
                        borderRadius: BorderRadius.all(
                          Radius.circular(20.0),
                        ),
                      ),
                      onPressed: () {
                        setState(() {
                          showDisplayPrediction = false;
                        });
                      },
                    ),
                  ],
                ),
              ),
            ),
          ],
        ),
      ),
    );
  }

  Widget _displayPredictionSection() {
    return !showDisplayPrediction
        ? Container()
        : Container(
            padding: EdgeInsets.only(left: 10.0, right: 10.0),
            child: Column(
              children: <Widget>[
                Container(
                  width: MediaQuery.of(context).size.width,
                  height: 75,
                  child: Row(
                    mainAxisAlignment: MainAxisAlignment.spaceAround,
                    children: <Widget>[
                      Container(
                        width: MediaQuery.of(context).size.width * 2.75 / 5,
                        decoration: BoxDecoration(
                          color: Colors.pink[100],
                          borderRadius: BorderRadius.all(Radius.circular(5.0)),
                        ),
                        child: Column(
                          children: <Widget>[
                            Text(
                              "ทำนาณดวงตามชื่อ",
                              style: TextStyle(
                                  fontSize: 16.0, color: Colors.black),
                            ),
                            AutoSizeText(
                              nameTopredict,
                              minFontSize: 16.0,
                              maxFontSize: 24.0,
                              maxLines: 1,
                              textAlign: TextAlign.start,
                              style: TextStyle(
                                fontSize: 24.0,
                                color: Colors.black,
                                fontWeight: FontWeight.bold,
                              ),
                            ),
                          ],
                        ),
                      ),
                      Container(
                        width: MediaQuery.of(context).size.width * 1.75 / 5,
                        decoration: BoxDecoration(
                          color: Colors.green[100],
                          borderRadius: BorderRadius.all(Radius.circular(5.0)),
                        ),
                        child: Column(
                          children: <Widget>[
                            Text(
                              "หลักเลขศาสตร์",
                              style: TextStyle(
                                  fontSize: 16.0, color: Colors.black),
                            ),
                            Text(
                              scienceNumber < 0 ? "" : "$scienceNumber",
                              style: TextStyle(
                                fontSize: 24.0,
                                color: Colors.black,
                                fontWeight: FontWeight.bold,
                              ),
                            ),
                          ],
                        ),
                      ),
                    ],
                  ),
                ),
                Container(
                  width: MediaQuery.of(context).size.width,
                  height: 30,
                  padding: EdgeInsets.all(5.0),
                  decoration: BoxDecoration(
                    color: Colors.cyan[300],
                    borderRadius: BorderRadius.all(Radius.circular(5.0)),
                  ),
                  child: AutoSizeText(
                    "ผลการทำนาย : ",
                    style:
                        TextStyle(fontSize: 18.0, fontWeight: FontWeight.bold),
                  ),
                ),
                Container(
                  width: MediaQuery.of(context).size.width,
                  height: 430,
                  padding: EdgeInsets.all(5.0),
                  decoration: BoxDecoration(
                    color: Colors.cyan[100],
                    borderRadius: BorderRadius.all(Radius.circular(5.0)),
                  ),
                  child: Text(
                    ((scienceNumber < 0) || (scienceNumber > 99) ? "" : result[scienceNumber]),
                    style: TextStyle(
                        fontSize: 18.0,
                        fontWeight: FontWeight.bold,
                        color: Colors.black),
                  ),
                ),
              ],
            ),
          );
  }

  _astrologyCalculation() {
    setState(() {
      scienceNumber = 0;
      for (int i = 0; i < nameTopredict.length; i++) {
        scienceNumber =
            scienceNumber + int.parse(data[nameTopredict[i]].toString());
      }
    });
  }
}
